Repository: openwrt/openwrt
Catalog: feeds/luci/applications/luci-app-dynapoint/po/*/dynapoint.po
Languages: es, hu, ja, mr, pl, ru

source: Activate this wVIF if status is:
es: Active este wVIF si el estado es:
hu: A wVIF bekapcsolása, ha az állapot:
ja: wVIFを有効化する接続ステータス:
mr: ही स्थिती असल्यास हे डब्ल्यूव्हीआयएफ सक्रिय करा:
pl: Aktywuj ten wVIF jeśli status jest:
ru: Применение DynaPoint-а

source: Append hostname to ssid
es: Adjuntar nombre de host a ssid
hu: Gépnév hozzáfűzése az SSID-hoz
ja: ホスト名をSSIDに追加する
mr: Ssid वर होस्टनाव जोडा
pl: Dołącz nazwę hosta do SSID
ru: Изменить SSID

source: Append the router's hostname to the SSID when connectivity check fails
es: Agregue el nombre de host del enrutador al SSID cuando falla la comprobación de conectividad
hu: Az útválasztó gépnevének hozzáfűzése az SSID-hoz, ha a kapcsolatellenőrzés sikertelen
ja: 接続性のチェックが失敗した場合、ルーターのホスト名をSSIDに追加します。
mr: कनेक्टिव्हिटी तपासणी अयशस्वी झाल्यास राऊटरचे होस्टनाव SSID वर जोडा
pl: Dodaj nazwę hosta routera do identyfikatora SSID, gdy kontrola łączności nie powiedzie się
ru: Добавление имени хоста роутера к SSID, если подключение к интернету отсутствует.

source: Check Internet connectivity via HTTP header download
es: Compruebe la conectividad de Internet a través de la descarga del encabezado HTTP
hu: Internetkapcsolat ellenőrzése HTTP fejléc letöltésén keresztül
ja: HTTP ヘッダーのダウンロードを通して、インターネットの接続性をチェックします。
mr: HTTP शीर्षलेख डाउनलोड द्वारे इंटरनेट कनेक्टिव्हिटी तपासा
pl: Sprawdź łączność z internetem za pomocą pobierania nagłówka HTTP
ru: Проверка подключения к интернету, с помощью получения HTTP-ответа.

source: Configuration
es: Configuración
hu: Beállítás
ja: 設定
mr: कॉन्फिगरेशन
pl: Konfiguracja
ru: Конфигурация

source: Curl is currently not installed. Please install the package in the
es: Curl no está instalado actualmente. Por favor instale el paquete en el
hu: A curl jelenleg nincs telepítve. Telepítse a csomagot a
ja: curl は現在インストールされていません。パッケージをインストールしてください。
mr: कर्ल सध्या स्थापित केलेले नाही. पॅकेज स्थापित करा
pl: Curl nie jest obecnie zainstalowany. Proszę zainstalować pakiet w
ru: Curl в настоящее время не установлен. Установите пакет на странице

source: Device
es: Dispositivo
hu: Eszköz
ja: デバイス
mr: डिव्हाइस
pl: Urządzenie
ru: Устройство

source: Disabled
es: Desactivado
hu: Letiltva
ja: 無効
mr: अक्षम
pl: Wyłączone
ru: Отключено

source: DynaPoint
mr: डायनापॉईंट

source: Dynamic Access Point Manager
es: Administrador de puntos de acceso dinámico
hu: Dinamikus hozzáférésipont-kezelő
ja: ダイナミック アクセスポイント マネージャー
mr: डायनॅमिक ऍक्सेस पॉईंट व्यवस्थापक
pl: Dynamiczny menedżer punktów dostępu
ru: Диспетчер динамических точек доступа.

source: Enabled
es: Activado
hu: Engedélyezve
ja: 有効
mr: सक्षम केले
pl: Włączone
ru: Включено

source: Failure counter after how many failed download attempts, the state is considered as offline
es: Contador de fallas después de cuántos intentos fallidos de descarga, el estado se considera fuera de línea
hu: Hibaszámláló, hogy hány sikertelen letöltési kísérlet után tekintendő az állapot kilépettnek
ja: 状態をオフラインと見なすまでの、ダウンロード試行の失敗回数です。
mr: डाउनलोडचे किती प्रयत्न अयशस्वी झाल्यानंतर, ही स्थिती ऑफलाइन मानली जाईल, यासाठीचा काउंटर
pl: Licznik awarii po ilu nieudanych próbach pobrania stan jest uważany za nieaktywny

source: List of Wireless Virtual Interfaces (wVIF)
es: Lista de interfaces virtuales inalámbricas (wVIF)
hu: Vezeték nélküli virtuális csatolók (wVIF) listája
ja: 無線仮想インターフェース (wVIF) のリスト
mr: वायरलेस व्हर्च्युअल इंटरफेसची यादी (डब्ल्यूव्हीआयएफ)
pl: Lista bezprzewodowych interfejsów wirtualnych (wVIF)

source: List of host addresses
es: Lista de direcciones de host
hu: Gép címeinek listája
ja: ホストアドレスのリスト
mr: होस्ट पत्त्यांची यादी
pl: Lista adresów hostów
ru: HTTP-адреса

source: List of host addresses (url or IP) to track and request http headers from
es: Lista de direcciones de host (url o IP) para rastrear y solicitar encabezados http de
hu: Gép címeinek listája (URL vagy IP), amelyektől a HTTP fejléceket követni és kérni kell
ja: HTTP ヘッダーの追跡およびリクエストを行う、ホスト アドレス（URLまたはIP）のリストです。
mr: http शीर्षलेख मागोवा घेण्यासाठी आणि विनंती करण्यासाठी होस्ट पत्त्याची यादी (url किंवा IP)
pl: Lista adresów hostów (URL lub IP) do śledzenia i żądania nagłówków HTTP
ru: Список HTTP-адресов (ссылка или IP-адрес) для проверки подключения к интернету.

source: Mode
es: Modo
hu: Mód
ja: モード
mr: मोड
pl: Tryb
ru: Режим

source: Not used by DynaPoint
es: No usado por DynaPoint
hu: Nem használja a DynaPoint
ja: DynaPointで使用しない
mr: डायनापॉईंटद्वारे न वापरलेले
pl: Nieużywany przez DynaPoint
ru: Не используется DynaPoint

source: Offline
es: Desconectado
hu: Nem érhető el
ja: オフライン
mr: ऑफलाइन
ru: Отключен

source: Online
es: Conectado
hu: Elérhető
ja: オンライン
mr: ऑनलाईन
ru: Онлайн

source: Software Section
es: Sección de Software
hu: Szoftver szakaszban
ja: ソフトウェアセクション
mr: सॉफ्टवेअर विभाग
pl: Sekcja oprogramowania
ru: 'Программное обеспечение'

source: Switch_to_offline threshold
es: Umbral Switch_to_offline
hu: Kilépettre váltás küszöbszintje
ja: オフライン化閾値
mr: ऑफलाईन_वर स्विच करण्याचे थ्रेशहोल्ड
pl: Próg Switch_to_offline
ru: Кол-во попыток

source: Test-run interval
es: Intervalo de prueba
hu: Tesztfuttatás időköze
ja: テスト実行間隔
mr: चाचणी मध्यांतर
pl: Interwał testu
ru: Интервал

source: Time interval in seconds to re-start a new test run
es: Intervalo de tiempo en segundos para reiniciar una nueva ejecución de prueba
hu: Időköz másodpercben egy új tesztfuttatás újraindításához
ja: 接続性テストを再実行するまでの時間間隔（秒）です。
mr: नवीन चाचणी पुन्हा सुरू करण्यासाठी सेकंदात वेळ मध्यांतर
pl: Odstęp czasowy w sekundach do ponownego uruchomienia nowego badania testowego
ru: Временной интервал в секундах, для повторного запуска проверки подключения к интернету.

source: Use curl
es: Usar curl
hu: Curl használata
ja: curl を使用する
mr: कर्ल वापरा
pl: Użyj curl
ru: Использовать curl

source: Use curl instead of wget
es: Use curl en lugar de wget
hu: Curl használata wget helyett
ja: wget の代わりに curl を使用する
mr: विजेटऐवजी कर्ल वापरा
pl: Użyj curl zamiast wget
ru: Curl вместо wget

source: Use curl instead of wget for testing the connectivity.
es: Usar curl en lugar de wget para probar la conectividad.
hu: Curl használata wget helyett a kapcsolat teszteléséhez.
ja: 接続性のテストの際、wget の代わりに curl を使用します。
mr: कनेक्टिव्हिटीची चाचणी घेण्यासाठी विजेटऐवजी कर्ल वापरा.
pl: Użyj curl zamiast wget do testowania łączności.
ru: Используйте curl вместо команды wget для тестирования подключения.

source: Used interface
es: Interfaz usada
hu: Használt csatoló
ja: 使用するインターフェース
mr: वापरलेला इंटरफेस
pl: Używany interfejs
ru: Используемый интерфейс

source: Which interface should curl use. (Use ifconfig to find out)
es: Que interfaz debe usar curl. (Utilice ifconfig para averiguarlo)
hu: Mely csatolónak kell a curl programot használnia. (Használja az ifconfig parancsot a megtaláláshoz)
ja: curl が使用するインターフェースです。ifconfigを使用してインターフェース名を確認します。
mr: कोणता इंटरफेस कर्ल करावा. (शोधण्यासाठी ifconfig वापरा)
pl: Interfejs który powinien być używany przez Curl. (Użyj ifconfig, aby się dowiedzieć)
ru: Какой интерфейс должен использовать curl. (Использовать команду ifconfig, чтобы узнать).

source: WiFi Status
es: Estado de Wi-Fi
hu: Wi-Fi állapota
ja: 無線ステータス
mr: वायफाय स्थिती
pl: Status WiFi
ru: Состояние
