Repository: openwrt/openwrt
Catalog: feeds/luci/applications/luci-app-nextdns/po/*/nextdns.po
Languages: pt_br

source: Available locations are: Switzerland, Iceland, Finland, Panama and Hong Kong.
pt_br: Os locais disponíveis são: Suíça, Islândia, Finlândia, Panamá e Hong Kong.

source: Configuration ID
pt_br: ID de Configuração

source: Enable NextDNS.
pt_br: Habilitar NextDNS.

source: Enabled
pt_br: Ativado

source: Expose LAN clients information in NextDNS analytics.
pt_br: Exponha as informações dos clientes da LAN na análise de NextDNS.

source: General
pt_br: Geral

source: Go to nextdns.io to create a configuration.
pt_br: Acesse nextdns.io para criar uma configuração.

source: Hardened Privacy
pt_br: Privacidade Reforçada

source: Log Queries
pt_br: Consultas de registro

source: Log individual queries to system log.
pt_br: Consultas de registros individuais ao registro do sistema.

source: Logs
pt_br: Registros

source: NextDNS Configuration.
pt_br: Configuração NextDNS.

source: Overview
pt_br: Visão Geral

source: Report Client Info
pt_br: Relatar Informações do Cliente

source: The ID of your NextDNS configuration.
pt_br: O ID de sua configuração NextDNS.

source: The syslog output, pre-filtered for nextdns related messages only.
pt_br: A saída do syslog, pré-filtrada somente para mensagens relacionadas ao nextdns.

source: When enabled, use DNS servers located in jurisdictions with strong privacy laws.
pt_br: Quando habilitado, usa servidores DNS localizados em jurisdições com leis fortes de privacidade.
