Repository: openwrt/openwrt
Catalog: feeds/luci/applications/luci-app-shairplay/po/*/shairplay.po
Languages: es

source: AO Device ID
es: ID de dispositivo AO

source: AO Device Name
es: Nombre del dispositivo AO

source: AO Driver
es: Controlador AO

source: Airport Name
es: Nombre de Airport

source: Default
es: Predeterminado

source: Enabled
es: Activado

source: HW Address
es: Dirección de HW

source: Password
es: Contraseña

source: Port
es: Puerto

source: Respawn
es: Reaparecer

source: Shairplay is a simple AirPlay server implementation, here you can configure the settings.
es: Shairplay es una implementación simple del servidor AirPlay, aquí puede configurar los ajustes.
