Repository: openwrt/openwrt
Catalog: feeds/luci/applications/luci-app-cshark/po/*/cshark.po
Languages: hu

source: Actions
hu: Műveletek

source: Capture URL
hu: URL rögzítése

source: Capture links
hu: Hivatkozások rögzítése

source: Capture time
hu: Idő rögzítése

source: Clear list
hu: Lista törlése

source: Filter
hu: Szűrő

source: Interface
hu: Csatoló

source: Loading
hu: Betöltés

source: Options
hu: Beállítások

source: Start capture
hu: Rögzítés indítása

source: Start network capture
hu: Hálózati rögzítés indítása

source: Stop capture
hu: Rögzítés leállítása

source: Waiting for capture to complete...
hu: Várakozás a rögzítés befejeződésére…

source: Waiting for upload to complete...
hu: Várakozás a feltöltés befejeződésére…

source: any
hu: bármely

source: bytes
hu: bájt

source: packets
hu: csomag

source: seconds
hu: másodperc

source: seconds, packets, bytes
hu: másodperc, csomag, bájt

source: timeout, bytes, seconds
hu: időkorlát, bájt, másodperc

source: value for [seconds, packets, bytes] must be Integer
hu: a [másodperc, csomag, bájt] értékének egész számnak kell lennie
