Repository: openwrt/openwrt
Catalog: feeds/luci/applications/luci-app-vpnbypass/po/*/vpnbypass.po
Languages: ru

source: Disable
ru: Отключить

source: Domains to Bypass
ru: Домены, для<br />обхода блокировки

source: Domains to be accessed directly (outside of the VPN tunnel), see
ru: Домены должны быть доступны напрямую (вне VPN-туннеля), см.

source: Enable
ru: Включить

source: Loading
ru: Загрузка

source: Local IP Addresses to Bypass
ru: Локальный IP-адрес<br />обхода VPN

source: Local IP addresses or subnets with direct internet access (outside of the VPN tunnel)
ru: Локальные IP-адреса или подсети с прямым доступом в интернет (вне VPN-туннеля)

source: Local Ports to Bypass
ru: Локальные порты для запуска обхода VPN

source: Local ports to trigger VPN Bypass
ru: Локальные порты<br />для обхода VPN

source: README
ru: Описание

source: Reload
ru: Перезапустить

source: Remote IP Addresses to Bypass
ru: Удаленные IP-адреса<br />обхода VPN

source: Remote IP addresses or subnets which will be accessed directly (outside of the VPN tunnel)
ru: Удаленные IP-адреса или подсети, которые будут доступны напрямую (вне туннеля VPN)

source: Remote Ports to Bypass
ru: Удаленные порты<br />для обхода VPN

source: Remote ports to trigger VPN Bypass
ru: Удаленные порты для запуска обхода VPN

source: Service Status
ru: Статус сервиса

source: Start
ru: Запустить

source: Stop
ru: Остановить

source: VPN Bypass
ru: Обход VPN

source: VPN Bypass Rules
ru: Правила обхода VPN

source: VPN Bypass Settings
ru: Настройка обхода VPN

source: for syntax
ru: для синтаксиса

source: is not installed or not found
ru: не установлен или не найден
