Repository: openwrt/openwrt
Catalog: feeds/luci/applications/luci-app-samba/po/*/samba.po
Languages: ro

source: Allow guests
ro: Permite oaspeti

source: Allow system users to reach their home directories via network shares
ro: Permite utilizatorii de sistem sa acceseze directoarele lor peste partajarile de retea

source: Allowed users
ro: Utilizatori acceptati

source: Create mask
ro: Creaza masca

source: Description
ro: Descriere

source: Directory mask
ro: Masca director

source: Edit Template
ro: Editeaza sablon

source: Edit the template that is used for generating the samba configuration.
ro: Editeaza sablonul care e folosit pentru generarea configuratiei samba.

source: General Settings
ro: SetÄƒri principale

source: Hostname
ro: Numele de host

source: Mask for new directories
ro: Masca pentru directoarele noi

source: Mask for new files
ro: Masca pentru fisierele noi

source: Name
ro: Nume

source: Network Shares
ro: Partajari pe retea

source: Path
ro: Cale

source: Read-only
ro: Doar citire

source: Share home-directories
ro: Partajeaza directoarele proprii

source: Shared Directories
ro: Directoare partajate

source: This is the content of the file '/etc/samba/smb.conf.template' from which your samba configuration will be generated. Values enclosed by pipe symbols ('|') should not be changed. They get their values from the 'General Settings' tab.
ro: Acesta este continutul fisierului '/etc/samba/smb.conf.template' din care se genereaza configuratia samba. Valorile dintre liniuta verticala ('|') n-ar trebui schimbate, ele iau valorile direct din tab-ul de "Setari generale".
