Repository: openwrt/openwrt
Catalog: feeds/luci/applications/luci-app-ahcp/po/*/ahcp.po
Languages: cs, he, pl

source: AHCP Server
he: שרת AHCP
pl: Serwer AHCP

source: AHCP is an autoconfiguration protocol for IPv6 and dual-stack IPv6/IPv4 networks designed to be used in place of router discovery or DHCP on networks where it is difficult or impossible to configure a server within every link-layer broadcast domain, for example mobile ad-hoc networks.
pl: AHCP jest protokołem autokonfiguracji dla sieci IPv6 i dual-stack IPv6/IPv4, przeznaczonym do wykorzystania w miejsce wykrywania routera lub DHCP w sieciach, w których konfiguracja serwera w każdej domenie nadawczej warstwy łączącej, np. w sieciach mobilnych ad-hoc, jest trudna lub niemożliwa.

source: Active AHCP Leases
cs: Aktivní AHCP zapůjčení
pl: Aktywne dzierżawy AHCP

source: Address
cs: Adresa
he: כתובת
pl: Adres

source: Advanced Settings
cs: Pokročilá nastavení
he: הגדרות מתקדמות
pl: Ustawienia zaawansowane

source: Age
cs: Stáří
he: גיל
pl: Wiek

source: Announced DNS servers
cs: Oznámené DNS servery
he: שרתי DNS מוכרזים
pl: Rozgłaszaj serwery DNS

source: Announced NTP servers
cs: Oznámené NTP servery
he: שרתי NTP מוכרזים
pl: Rozgłaszane serwery NTP

source: Announced prefixes
cs: Oznámené předčíslí
he: קידומות מוכרזות
pl: Rozgłaszane prefiksy

source: Collecting data...
cs: Shromažďování údajů…
he: אוסף נתונים...
pl: Trwa zbieranie danych...

source: Disable DNS setup
cs: Zakázat nastavení DNS
pl: Wyłącz konfigurację DNS

source: Forwarder
cs: Přesměrování
pl: Przekazywanie

source: General Setup
cs: Obecné nastavení
he: התקנה כללית
pl: Ustawienia ogólne

source: IPv4 and IPv6
cs: IPv4 a IPv6
he: IPv4 ו- IPv6
pl: IPv4 i IPv6

source: IPv4 only
cs: pouze IPv4
he: IPv4 בלבד
pl: Tylko IPv4

source: IPv6 only
cs: pouze IPv6
he: IPv6 בלבד
pl: Tylko IPv6

source: Lease directory
cs: Zapůjčené adresáře
pl: Katalog dzierżaw

source: Lease validity time
cs: Doba platnosti zapujčení
he: תוקף ההקצאה
pl: Czas ważności dzierżawy

source: Log file
cs: Soubor pro záznam událostí
he: קובץ רישום
pl: Plik dziennika

source: Multicast address
cs: Vícesměrové adresy
he: כתובת Multicast
pl: Adres Multicast

source: Operation mode
cs: Pracovní režim
he: מצב הפעלה
pl: Tryb pracy

source: Protocol family
cs: Rodina protokolů
he: משפחת פרוטוקולים
pl: Rodzina protokołów

source: Served interfaces
cs: Obsluhované rozhraní
he: סיגמנטים מופעלים
pl: Udostępniane interfejsy

source: Server
he: שרת
pl: Serwer

source: Specifies the announced IPv4 and IPv6 NTP servers
cs: Specifikuje ohlášené IPv4 a IPv6 NTP servery
he: שרתי NTP ברשתות IPV4 IPV6
pl: Określa rozgłaszane adresy IPv4/IPv6 serwerów NTP

source: Specifies the announced IPv4 and IPv6 name servers
cs: Specifikuje ohlášené IPv4 a IPv6 name servery
he: שרתי DNS ברשתות IPV4 IPV6
pl: Określa rozgłaszane adresy IPv4/IPv6 serwerów nazw

source: Specifies the announced IPv4 and IPv6 network prefixes in CIDR notation
cs: Specifikuje ohlášené IPv4 a IPv6 sítě předpony v CIDR notaci
he: קידומת שרתים (CIDR)
pl: Określa rozgłaszane prefiksy sieciowe IPv4 i IPv6 w notacji CIDR

source: The AHCP Service is not running.
cs: Služba AHCP neběží
pl: Usługa AHCP nie jest uruchomiona.

source: The AHCP Service is running with ID %s.
cs: Služba AHCP je spuštěna s ID %s.
pl: Usługa AHCP jest uruchomiona z ID %s.

source: There are no active leases.
cs: Neexistují žádná aktivní pronajmutí.
he: אין הקצאות פעילות.
pl: Nie ma aktywnych dzierżaw.

source: Unique ID file
cs: Jedinečný ID soubor
he: קובץ מזהה יחודי
pl: Unikalny plik ID

source: Port
he: פורט
