#!/bin/sh
#by:xinqn
# 显示用户选择菜单
echo "1、短信转发Smstrun 1.4"
echo "2、LED 兼容控制"
echo "3、流量白送功能"
echo "4、国际漫游设置"
echo "5、终端基站扫描"
echo "6、L2TP-SIM拨号"
echo "7、ADB-解锁程序"
read -p "请输入数字并回车选择操作：" choice
case $choice in
    1)
        dxzf.sh
        echo "--------------------------------"
        ;;
    2)
        led.sh
        echo "--------------------------------"
        ;;
    3)
        sll.sh
        echo "--------------------------------"
        ;;
    4)
        gjmy.sh
        echo "--------------------------------"
        ;;
    5)
        扫描基站.sh
        echo "--------------------------------"
        ;;
    6)
        l2tpsim.sh
        echo "--------------------------------"
        ;;
    7)
        python3 /usr/bin/adbunloc.py
        echo "--------------------------------"
        ;;
   *)
        echo "无效的选择，请重新运行脚本并输入有效数字。"
        ;;
esac
