Repository: openwrt/openwrt
Catalog: feeds/luci/applications/luci-app-dump1090/po/*/dump1090.po
Languages: pt

source: Absolute maximum range for position decoding
pt: Alcance máximo absoluto para descodificação da posição

source: Accuracy of receiver location in json metadata
pt: Precisão da localização do recetor em metadados json

source: Allow forwarding of received mlat results to output ports
pt: Permitir o encaminhamento dos resultados mlat recebidos para as portas de saída

source: Apply a 1Hz DC filter to input data
pt: Aplicar um filtro DC de 1 Hz aos dados de entrada

source: Base directory for the internal HTTP server
pt: Diretório base para o servidor HTTP interno

source: Collect/show range histogram
pt: Coletar/exibir histograma de alcance

source: Data file
pt: Ficheiro de dados

source: Debug mode flags
pt: Sinalizadores de modo de depuração

source: Default
pt: Padrão

source: Disable messages with broken CRC
pt: Desativar mensagens com CRC quebrado

source: Disable single-bits error correction using CRC
pt: Desativar a correção de erros de bits únicos usando CRC

source: Display raw messages in Beast ascii mode
pt: Exibir mensagens cruas no modo Beast ascii

source: Do not apply CRC corrections to messages we forward
pt: Não aplicar correções CRC às mensagens que encaminhamos

source: Enable automatic gain control
pt: Ativar o controle de ganho automático

source: Enable decoding of SSR Modes 3/A & 3/C
pt: Ativar a descodificação dos modos SSR 3/A & 3/C

source: Enable just networking, no RTL device or file used
pt: Ativar apenas a rede, sem usar nenhum aparelho ou ficheiro RTL

source: Enable networking
pt: Ativar a rede

source: Enable phase enhancement
pt: Ativar o aprimoramento da fase

source: Enable single-bits error correction using CRC
pt: Ativar a correção de erros de bits únicos usando CRC

source: Enabled
pt: Ativado

source: FlightAware TSV output port
pt: Porta de saída TSV do FlightAware

source: Frequency
pt: Frequência

source: Gain (-10 for auto-gain)
pt: Ganho (-10 para auto-ganho)

source: HTTP server port
pt: Porta do servidor HTTP

source: IP address to bind to
pt: Endereço IP para ligar

source: Measure noise power
pt: Medir a potência do ruído

source: More CPU for more messages
pt: Mais CPU para mais mensagens

source: Periodically write json output to a directory
pt: Periodicamente escrever a saída json para um diretório

source: Print stats at exit
pt: Imprimir estatísticas na saída

source: RTL device index
pt: Índice de aparelhos RTL

source: Reference/receiver latitude for surface posn
pt: Referência/latitude do recetor para a posn de superfície

source: Reference/receiver longitude for surface posn
pt: Referência/longitude do recetor para a posn de superfície

source: Respawn
pt: Redisparar

source: Sample format for data file
pt: Formato de amostra para ficheiro de dados

source: Set receiver error in parts per million
pt: Defina o erro do recetor em partes por milhão

source: Show and reset stats every seconds
pt: Mostrar e redefinir estatísticas a cada segundo

source: Show only ICAO addresses
pt: Mostrar apenas endereços ICAO

source: Show only messages hex values
pt: Mostrar apenas os valores hexadecimais das mensagens

source: Strip IQ file removing samples
pt: Esvaziar ficheiro IQ removendo amostras

source: TCP BaseStation output listen port
pt: Porta de escuta de saída TCP BaseStation

source: TCP Beast input listen port
pt: Porta de escuta de entrada TCP Beast

source: TCP Beast output listen port
pt: Porta de escuta de saída TCP Beast

source: TCP buffer size 64Kb * (2^n)
pt: Tamanho do buffer TCP 64Kb * (2^n)

source: TCP heartbeat rate in seconds
pt: Taxa de heartbeat TCP em segundos

source: TCP raw input listen port
pt: Porta de escuta de entrada TCP cru

source: TCP raw output in Beast binary format
pt: Saída de TCP cru em formato binário Beast

source: TCP raw output listen port
pt: Porta de escuta de saída TCP cru

source: TCP raw output memory flush rate in seconds
pt: Taxa de limpeza da memória de saída TCP cru em segundos

source: TCP raw output minimum size
pt: Tamanho mínimo de saída TCP cru

source: Use metric units
pt: Usar unidades métricas

source: Use the 2.4MHz demodulator
pt: Usar o demodulador de 2.4MHz

source: When reading from a file play back in realtime, not at max speed
pt: Ao ler de um ficheiro, reproduzir em tempo real, não à velocidade máxima

source: Write json output every t seconds
pt: Escrever saída json a cada t segundos

source: dump1090 is a Mode S decoder specifically designed for RTLSDR devices, here you can configure the settings.
pt: dump1090 é um descodificador Mode S especificamente concebido para aparelhos RTLSDR, aqui pode configurar as definições.
