Repository: openwrt/openwrt
Catalog: feeds/luci/applications/luci-app-adblock/po/*/adblock.po
Languages: de, es, fr, hu, it, ja, pl, pt, ru, zh_hans

source: <b>Caution:</b> To prevent OOM exceptions on low memory devices with less than 64 MB free RAM, please only select a few of them!
de: <b>Vorsicht:</b> Um Speicherengpässe auf Geräten mit weniger als 64 MB freiem Arbeitsspeicher zu vermeiden, wählen Sie nicht zu viele aus!
es: <b>Precaución:</b> Para evitar excepciones de OOM en dispositivos con poca memoria con menos de 64 MB de RAM libre, ¡solo seleccione algunos de ellos!
fr: <b>Attention :</b> Pour éviter les exceptions de dépassement de mémoire sur les appareils disposant de moins de 64 Mo de RAM libre, veuillez n'en sélectionner que quelques uns !
hu: <b>Vigyázat:</b> a 64 MB-nál kevesebb szabad RAM-mal rendelkező eszközöknél az „elfogyott a memória” kivételek megakadályozásához csak néhányat válasszon ki közülük!
it: <b>Attenzione:</b> al fine di prevenire errori OOM su dispositivi con meno di 64 MB RAM disponibili, per favore selezionane solamente alcune!
ja: <b>警告:</b> RAM の空き容量が 64MB に満たないメモリー容量の小さいデバイスでは、 OutOfMemory (OOM) 例外を防ぐために少数のみを選択してください。
pl: <b>Uwaga:</b> Aby uniknąć błędów braku pamięci (OOM) na urządzeniach z mniej niż 64 MB wolnej pamięci RAM, wybierz tylko kilka z nich!
pt: <b>Perigo:</b> Para prevenir exceções OOM em dispositivos com pouca memória, com menos de 64 MB de RAM livre, por favor apenas selecione alguns!
ru: <b>Внимание:</b> Для предотвращения переполнения оперативной памяти, на устройствах с менее 64 MB, выбирайте только необходимый минимум списков!
zh_hans: <b>注意：</b>为防止可用内存少于 64 MB 的低内存设备出现 OOM 异常，请仅选择其中一些！

source: Action
de: Aktion
es: Acción
hu: Művelet
it: Azione
ja: アクション
pl: Akcja
pt: Ação
ru: Действие
zh_hans: 动作

source: Adblock
de: Werbeblocker
fr: Bloqueur de publicité
hu: Reklámblokkoló
pl: Blokowanie reklam
ru: Adblock Блокировщик рекламы
zh_hans: 广告拦截

source: Adblock Status
de: Werbeblocker-Status
es: Estado de Adblock
fr: État du bloqueur de publicité
hu: Reklámblokkoló állapota
it: Status Adblock
ja: Adblock ステータス
pl: Status Adblocka
pt: Status do Adblock
ru: Состояние Adblock
zh_hans: Adblock 状态

source: Adblock Version
de: Werbeblocker-Version
es: Versión de Adblock
fr: Version du bloqueur de publicité
hu: Reklámblokkoló verziója
it: Versione Adblock
ja: Adblock バージョン
pl: Wersja Adblocka
pt: Versão do Adblock
ru: Версия Adblock
zh_hans: Adblock 版本

source: Additional trigger delay in seconds before adblock processing begins.
de: Zusätzliche Trigger-Verzögerung (in Sekunden) bevor die Verarbeitung durch den Werbeblocker beginnt.
es: Demora adicional del disparador en segundos antes de que comience el procesamiento de adblock.
fr: Délai de déclenchement supplémentaire en secondes avant que le bloqueur de publicité démarre.
hu: További aktiválókésleltetés másodpercben, mielőtt a reklámblokkolás feldolgozása elkezdődik.
it: Tempo addizionale in secondi di attesa prima che adblock si avvii.
ja: Adblock の処理が開始されるまでの、追加の遅延時間（秒）です。
pl: Dodatkowe opóźnienie wyzwalacza w sekundach przed rozpoczęciem przetwarzania adblocka.
pt: Atraso adicional do trigger em segundos antes do processamento do Adblock começar.
ru: Дополнительная задержка в секундах до начала работы Adblock.
zh_hans: 事件触发启动前的延时（秒）。

source: Advanced
de: Fortgeschritten
es: Avanzado
fr: Avancé
hu: Speciális
it: Avanzato
ja: 詳細設定
pl: Zaawansowane
pt: Avançado
ru: Дополнительно
zh_hans: 高级

source: Answer
de: Antwort
es: Responder
fr: Répondre
hu: Válasz
it: Risposta
ja: 回答
pl: Odpowiedź
pt: Resposta
ru: Ответ
zh_hans: 回答

source: Archive Categories
de: Archiv-Kategorien
es: Categorías de archivo
fr: Archiver les catégories
hu: Kategóriák archiválása
it: Archivia Categorie
ja: アーカイブ カテゴリ
pl: Kategoria
pt: Categorias de Arquivos
ru: Категории списков
zh_hans: 存档类别

source: Backup Directory
de: Backupverzeichnis
es: Directorio de respaldo
fr: Répertoire de sauvegarde
hu: Biztonsági mentés könyvtára
it: Directory del Backup
ja: バックアップ先 ディレクトリ
pl: Katalog kopii zapasowej
pt: Diretório do Backup
ru: Папка для резервных копий
zh_hans: 备份目录

source: Blacklist
de: Negativliste
es: Lista negra
fr: Liste noire
hu: Feketelista
it: Lista di Blocco
ja: ブラックリスト
pl: Czarna lista
pt: Lista Negra
ru: Чёрный список
zh_hans: 黑名单

source: Blacklist File
de: Datei auf die Blacklist setzen
es: Archivo de lista negra
fr: Fichier de liste noire
hu: Feketelistafájl
it: File Lista di Blocco
ja: ブラックリスト ファイル
pl: Plik czarnej listy
pt: Ficheiro da Lista Negra
ru: Файл черного списка
zh_hans: 黑名单文件

source: Blocked DNS Queries
de: Geblockte DNS-Anfragen
es: Consultas DNS bloqueadas
fr: Requêtes DNS bloquées
hu: Blokkolt DNS-lekérdezések
it: Query DNS Bloccate
ja: ブロックされた DNS クエリ
pl: Zablokowane listy zapytań DNS
pt: Pedidos DNS Bloqueados
ru: Блокируемые DNS запросы
zh_hans: 已拦截的 DNS 请求

source: Blocked Domain
de: Geblockte Domain
es: Dominio bloqueado
fr: Domaines bloqués
hu: Blokkolt tartomány
it: Dominio bloccato
ja: ブロックされたドメイン
pl: Zablokowane domeny
pt: Domínio Bloqueado
ru: Блокированные домены
zh_hans: 已拦截的域名

source: Blocklist Sources
de: Geblockte Quellen
es: Fuentes de lista de bloqueo
fr: Sources des listes de blocage
hu: Blokkolási lista forrásai
it: Fonti lista di Blocco
ja: ブロックリスト提供元
pl: Źródła list blokujących
pt: Origem da Blocklist
ru: Источники списков блокировок
zh_hans: 拦截列表来源

source: Blocklist not found!
de: Liste mit Blockierungen nicht gefunden!
es: Lista de bloqueo no encontrado!
fr: Liste de blocage introuvable !
hu: Nem található blokkolási lista!
it: Lista di Blocco non trovata!
ja: ブロックリストが見つかりません！
pl: Nie znaleziono list blokujących!
pt: Blocklist não encontrada!
ru: Список блокировок не найден!
zh_hans: 拦截列表未找到！

source: Choose 'none' to disable automatic startups, 'timed' to use a classic timeout (default 30 sec.) or select another trigger interface.
de: Wählen Sie 'none', um den automatischen Auftstart auszuschalten, 'timed', um ein Timeout zu setzen, oder wählen sie einen anderen Auslöser.
es: Elija 'none' para desactivar los inicios automáticos, 'timed' para usar un tiempo de espera clásico (30 segundos como predeterminado) o seleccione otra interfaz de activación.
fr: Choisissez « aucun » pour désactiver le démarrage automatique, « chronométré » pour utiliser un décompte classique (par défaut 30 s) ou sélectionnez une autre interface de déclenchement.
hu: Válassza a „none” értéket az automatikus indítások letiltásához, a „timed” értéket egy klasszikus időkorlát használatához (alapértelmezetten 30 másodperc) vagy válasszon egy másik aktiválófelületet.
it: Scegli 'none' per disabilitare l'avvio automatico, 'timed' per usare un classico timeout (default 30 sec.) o seleziona un'altra interfaccia di avvio.
ja: 自動スタートアップを無効にするには 'none' を、従来のタイムアウト（既定値: 30秒）を使用するには 'timed' を選択してください。または、他のトリガとなるインターフェースを選択してください。
pl: Wybierz 'none', aby wyłączyć automatyczne uruchamianie, 'timed', aby użyć klasycznego limitu czasu (domyślnie 30 sek.) lub wybierz inny interfejs wyzwalacza.
pt: Escolha 'nenhum' para desativar arranques automáticos, 'temporizado' para usar um tempo limite clássico (predefinido 30 seg.) ou selecionar outra interface trigger.
ru: Выберите 'none', чтобы отключить автоматический старт, 'timed', чтобы использовать стандартную задержку (по умолчанию 30 сек.) или выберите другой интерфейс для запуска.
zh_hans: 选择“none”以禁用自动启动，“timed”以使用默认的超时设定（默认 30 秒），或选择另一个触发接口。

source: Client
es: Cliente
hu: Ügyfél
ja: クライアント
pl: Klient
pt: Cliente
ru: Клиент
zh_hans: 客户端 Client

source: Collecting data...
de: Sammle Daten...
es: Recolectando datos…
fr: Récupération des données…
hu: Adatok összegyűjtése…
it: Raccogliendo dati...
ja: データ収集中です...
pl: Trwa zbieranie danych...
pt: A recolher dados...
ru: Сбор данных...
zh_hans: 正在收集数据…

source: Configuration of the adblock package to block ad/abuse domains by using DNS.
de: Konfiguration des adblock-Packetes zum Blockieren von Werbe-/ missbräulichen Domains durch die Nutzung des DNS.
es: Configuración del paquete adblock para bloquear dominios de anuncios/abuso mediante el uso de DNS.
fr: Configuration du paquet du bloqueur de publicité pour bloquer les domaines publicitaires/abusifs en utilisant le DNS.
hu: A reklámblokkoló csomag beállítása a reklámhoz és visszaéléshez használt tartományok blokkolásához DNS használatával.
it: Configurazione del pacchetto adblock per bloccare domini pubblicità/abuso usando i DNS.
ja: DNS の利用によって広告/不正ドメインをブロックする、Adblock パッケージの設定です。
pl: Konfiguracja pakietu adblock do blokowania reklam/nadużyć przy użyciu systemu DNS.
pt: Configuração do pacote adblock para bloquear anúncios/domínios abusivos usando o DNS.
ru: Настройка Adblock. Приложения для блокировки рекламных или ненадежных доменов используя DNS.
zh_hans: Adblock 配置工具，通过 DNS 来拦截广告和阻止域名。

source: Count
de: Anzahl
es: Contar
fr: Compteur
hu: Darabszám
it: Numero
ja: カウント
pl: Licznik
pt: Contagem
ru: Счёт
zh_hans: 计数

source: DNS Backend (DNS Directory)
de: DNS Backend (DNS Verzeichnis)
es: DNS Backend (Directorio DNS)
fr: Terminal DNS (répertoire DNS)
hu: DNS háttérprogram (DNS könyvtár)
it: Backend DNS (Directory DNS)
ja: DNS バックエンド（DNS ディレクトリ）
pl: Zaplecze DNS
pt: Backend DNS (Diretório do DNS)
ru: DNS бэкенд (папка DNS)
zh_hans: DNS 后端（DNS 目录）

source: DNS Backend, DNS Directory
de: DNS Backend, DNS Verzeichnis
es: Servidor DNS, Directorio DNS
fr: Terminal DNS, Répertoire DNS
hu: DNS háttérprogram, DNS könyvtár
it: Backend DNS, Directory DNS
ja: DNS バックエンド, DNS ディレクトリ
pl: Zaplecze DNS, Katalog DNS
pt: Backend DNS, Diretório DNS
ru: Внутренний DNS, DNS каталог
zh_hans: DNS 后端，DNS 目录

source: DNS Blocking Variant
de: Art der DNS-Blockade
es: Variante de bloqueo de DNS
fr: Variante de blocage DNS
hu: DNS blokkolási változat
it: Variante di blocco DNS
ja: DNS ブロック種別
pl: Wariant blokowania DNS
pt: Variante de bloqueio de DNS
ru: Блокировавший вариант DNS
zh_hans: DNS 拦截方法

source: DNS Directory
de: DNS-Verzeichnis
es: Directorio DNS
fr: Répertoire du DNS
hu: DNS könyvtár
it: Directory DNS
ja: DNS ディレクトリ
pl: Katalog DNS
pt: Diretório DNS
ru: Папка DNS
zh_hans: DNS 目录

source: DNS File Reset
de: DNS-Datei zurücksetzen
es: Restablecimiento de archivos DNS
fr: Réinitialiser le fichier de DNS
hu: DNS fájlvisszaállítás
it: Reset File DNS
ja: DNS ファイル リセット
pl: Resetuj plik DNS
pt: Repor o ficheiro DNS
ru: Сброс файла DNS
zh_hans: DNS 文件重置

source: DNS Inotify
fr: Notifications DNS
hu: DNS inode-értesítés
pl: Powiadomienie DNS
pt: Inotify DNS
ru: DNS-оповещение
zh_hans: DNS 验证

source: DNS Query Report
de: DNS-Anfragebericht
es: Informe de consulta de DNS
fr: Rapport de requête DNS
hu: DNS-lekérdezési jelentés
it: Report Query DNS
ja: DNS クエリ レポート
pl: Raport zapytań DNS
pt: Relatório de Consulta DNS
ru: Репорт запроса DNS
zh_hans: DNS 查询报告

source: DNS Variant, DNS File Reset
de: DNS-Variante, DNS-Datei zurücksetzen
es: Variante DNS, Restablecimiento de archivos DNS
fr: Variante de DNS, Réinitialisation du fichier DNS
hu: DNS változat, DNS fájlvisszaállítás
it: Variante DNS, Reset File DNS
ja: DNS 種別, DNS ファイル リセット
pl: Wariant DNS, resetuj plik DNS
pt: Variante DNS, repor o ficheiro DNS
ru: Вариант DNS, Сброс файла DNS
zh_hans: DNS 变量，DNS 文件重置

source: Date
de: Datum
es: Fecha
hu: Dátum
it: Data
ja: 日付
pl: Data
pt: Data
ru: Дата
zh_hans: 日期

source: Description
de: Beschreibung
es: Descripción
hu: Leírás
it: Descrizione
ja: 説明
pl: Opis
pt: Descrição
ru: Описание
zh_hans: 描述

source: Disable adblock triggered restarts and the 'DNS File Reset' for dns backends with autoload features.
de: Deaktivieren von adblockgesteuerten Neustarts und 'DNS File Reset' für DNS-Backends mit Autoload-Funktionen.
es: Desactive los reinicios activados por adblock y el 'Restablecimiento de archivos DNS' para back-end dns con funciones de carga automática.
hu: A reklámblokkoló letiltása aktiválta az újraindításokat és a „DNS fájlvisszaállítást” az automatikus betöltés funkciókkal rendelkező DNS háttérprogramoknál.
ja: 自動読み込み機能を持つ DNS バックエンドのため、adblockが引き起こす再起動と 'DNS ファイル リセット' を無効にします。
pt: Desativar as reinicializações acionadas pelo adblock e o 'Repor o Ficheiro de DNS' para backends dns com recursos de autocarga.
zh_hans: 禁用 adblock 触发的重新启动以及具有自动加载功能的 dns 后端的“DNS 文件重置”。

source: Disable the toplevel domain compression, if the number of blocked domains is greater than this threshold.
de: Deaktivieren der Toplevel-Domänen-Komprimierung, wenn die Anzahl der blockierten Domänen größer als dieser Schwellenwert ist.
es: Desactive la compresión de dominio de nivel superior, si el número de dominios bloqueados es mayor que este umbral.
fr: Désactiver la compression des réponses de haut niveau si le nombre de domaine bloqués est supérieur à ce seuil.
hu: Tiltsa meg a legfelső szintű tartomány tömörítését, ha a blokkolt tartományok száma nagyobb ennél a küszöbszintnél.
it: Disabilita la compressione del Dominio di Toplevel, se il numero dei domini bloccati è maggiore di questa soglia.
ja: ブロックされたドメイン数がこの閾値を超える場合、トップレベル ドメインの圧縮を無効にします。
pl: Wyłącz kompresję domen najwyższego poziomu, jeśli liczba zablokowanych domen jest większa niż ten próg.
pt: Desative a compressão de domínio toplevel, se a quantidade de domínios bloqueados for maior que este limite.
ru: Отключить сжатие доменам, если число заблокированных доменов превышает этот порог.
zh_hans: 如果阻止的域名数大于此阈值，则禁用顶级域名压缩。

source: Dnsmasq also supports 'null' block variants, which may provide better response times.
de: Dnsmasq unterstützt auch 'null' Blockvarianten, was zu besseren Antwortzeiten führen kann.
es: Dnsmasq también admite variantes de bloque 'nulo', que pueden proporcionar mejores tiempos de respuesta.
fr: Dnsmaq supporte également l'option "null block", celle-ci peut fournir de meilleurs temps de réponse.
hu: A dnsmasq támogatja a „null” blokkolási változatot is, amely jobb válaszidőket nyújt.
it: Dnsmasq supporta anche le varianti di blocco 'null', le quali potrebbero portare migliori tempi di risposta.
ja: Dnsmasq は、より応答時間に優れることがあるブロック種別 'null' も提供します。
pl: Dnsmasq również wspiera warianty blokowania 'null', które mogą zapewnić lepsze czasy reakcji.
pt: O dnsmasq também suporta variantes de bloco 'null', que podem fornecer melhores tempos de resposta.
ru: Dnsmask также поддерживает вариант "null" блок, который позволяет лучше реагировать на запросы.
zh_hans: Dnsmasq 还支持“null”方法，这可以提供更好的响应时间。

source: Domain
de: Domäne
es: Dominio
fr: Domaine
hu: Tartomány
it: Dominio
ja: ドメイン
pl: Domena
pt: Domínio
ru: Домен
zh_hans: 域名

source: Domain/Client/Date/Time
de: Domäne/Client/Datum/Zeit
es: Dominio/Cliente/Fecha/Hora
fr: Domaine/Client/Date/Heure
hu: Tartomány/kliens/dátum/idő
it: Dominioo/Client/Data/Ora
ja: ドメイン / クライアント / 日付 / 時刻
pl: Domena/Klient/Data/Czas
pt: Domínio/Cliente/Data/Hora
ru: Домен/Клиент/Дата/Время
zh_hans: 域名/客户端/日期/时间

source: Download Utility
de: Download-Werkzeug
es: Utilidad de descarga
fr: Télécharger l'utilitaire
hu: Letöltési segédprogram
it: Utilità di Scaricamento
ja: ダウンロード ユーティリティ
pl: Narzędzie pobierania
pt: Ferramenta para descarregar
ru: Утилита для скачивания
zh_hans: 下载工具

source: Download Utility (SSL Library)
de: Download-Werkzeug (SSL-Bibliothek)
es: Utilidad de descarga (Biblioteca SSL)
fr: Télécharger l'utilitaire (Bibliothèque SSL)
hu: Letöltési segédprogram (SSL programkönyvtár)
it: Utilità di scaricamento (Libreria SSL)
ja: ダウンロード ユーティリティ（SSL ライブラリ）
pl: Narzędzie pobierania (SSL)
pt: Ferramenta para descarregar (Biblioteca SSL)
ru: Утилита для скачивания (с библиотекой SSL)
zh_hans: 下载实用程序（SSL 库）

source: E-Mail Notification
de: E-Mail-Benachrichtigung
es: Notificación del E-Mail
fr: Notifications par e-mail
hu: E-mail értesítés
it: Notifica E-Mail
ja: Eメール通知
pl: Powiadomienie email
pt: Notificação por e-mail
ru: Уведомление электронной почты
zh_hans: E-Mail 通知

source: E-Mail Notification Count
de: E-Mail-Benachrichtigungsanzahl
es: Conteo de notificaciones por E-Mail
hu: E-mail értesítés darabszáma
ja: Eメール通知カウント
pt: Contagem de notificação de e-mail
zh_hans: E-Mail 通知计数

source: E-Mail Profile
de: E-Mail-Profil
es: Perfil del E-Mail
fr: Profil e-mail
hu: E-mail profil
ja: Eメール プロファイル
pt: Perfil de e-mail
zh_hans: E-Mail 资料

source: E-Mail Receiver Address
de: E-Mail-Empfängeradresse
es: Dirección del destinatario del E-Mail
fr: Adresse e-mail du destinataire
hu: E-mail fogadócím
it: E-Mail destinatario
ja: Eメール受信アドレス
pl: Adres email odbiorcy
pt: Endereço do destinatário de e-mail
ru: Адрес получателя электронной почты
zh_hans: E-Mail 收件人地址

source: E-Mail Sender Address
de: E-Mail-Absenderadresse
es: Dirección del remitente del E-Mail
fr: Adresse e-mail de l'envoyeur
hu: E-mail küldőcím
ja: Eメール送信アドレス
pt: Endereço do remetente de e-mail
zh_hans: E-Mail 发件人地址

source: E-Mail Topic
de: E-Mail-Thema
es: Tema del E-Mail
fr: Objet de l'e-mail
hu: E-mail téma
ja: Eメール題名
pt: Tópico do e-mail
zh_hans: E-Mail 主题

source: Edit Blacklist
de: Negativliste bearbeiten
es: Editar lista negra
fr: Modifier la liste noire
hu: Feketelista szerkesztése
it: Modifica Lista Nera
ja: ブラックリストの編集
pl: Edycja czarnej listy
pt: Editar lista negra
ru: Редактировать Черный список
zh_hans: 编辑黑名单

source: Edit Configuration
de: Konfiguration bearbeiten
es: Editar configuración
fr: Modifier la configuration
hu: Beállítás szerkesztése
it: Modifica Configurazione
ja: 設定の編集
pl: Edycja konfiguracji
pt: Editar configuração
ru: Редактировать config файл
zh_hans: 编辑设置

source: Edit Whitelist
de: Positivliste bearbeiten
es: Editar lista blanca
fr: Modifier la liste blanche
hu: Fehérlista szerkesztése
it: Modifica Lista Bianca
ja: ホワイトリストの編集
pl: Edycja białej listy
pt: Editar lista de permissões
ru: Редактировать Белый список
zh_hans: 编辑白名单

source: Enable Adblock
de: Adblock aktivieren
es: Activar
fr: Activer le bloqueur de publicité
hu: Reklámblokkolás engedélyezése
it: Attiva Adblock
ja: Adblock の有効化
pl: Włącz Adblocka
pt: Ativar Adblock
ru: Включить Adblock
zh_hans: 启用 Adblock

source: Enable verbose debug logging in case of any processing error.
de: Ausführliche Debug-Protokollierung im Falle eines Verarbeitungsfehlers aktivieren.
es: Activa el registro de depuración detallado en caso de cualquier error de procesamiento.
fr: Activer le mode verbeux en cas d'erreur de traitement.
hu: Részletes hibakeresési naplózás engedélyezése bármilyen feldolgozási hiba esetén.
it: Abilita il registro dettagliato in caso di qualsiasi errore di processo.
ja: 何らかの処理エラーが発生した場合に、詳細なデバッグ ログを有効にします。
pl: Włącz pełne rejestrowanie debugowania w przypadku jakiegokolwiek błędu przetwarzania.
pt: Ativar o registro de depuração detalhado no caso de qualquer erro de processamento.
ru: Включить ведение подробного журнала для отладки в случае ошибок обработки.
zh_hans: 在出现任何处理错误的情况下启用详细调试日志记录。

source: Enabled
de: Aktiviert
es: Activado
fr: Activé
hu: Engedélyezve
it: Abilitato
ja: 有効
pl: Włączone
pt: Ativado
ru: Включено
zh_hans: 已启用

source: End Date
de: Enddatum
es: Fecha final
fr: Date de fin
hu: Befejezési dátum
it: Data Fine
ja: 終了日
pl: Data końcowa
pt: Data final
ru: Дата окончания
zh_hans: 结束日期

source: Extra Options
de: Zusätzliche Optionen
es: Opciones extra
fr: Options supplémentaires
hu: További beállítások
it: Opzioni Extra
ja: 拡張オプション
pl: Opcje dodatkowe
pt: Opções Adicionais
ru: Дополнительные настройки
zh_hans: 额外选项

source: Filter
es: Filtrar
fr: Filtrer
hu: Szűrő
it: Filtro
ja: フィルタ
pl: Filtr
pt: Filtro
ru: Фильтр
zh_hans: 过滤器

source: Filter the DNS Query result set for a particular domain, client or time frame.
de: DNS-Abfrageergebnis nach bestimmter Domain, bestimmtem Client oder bestimmtem Zeitrahmen filtern.
es: Filtrar el conjunto de resultados de la consulta de DNS para un dominio, cliente o período de tiempo en particular.
fr: Filtrer les réponses DNS pour un domaine particulier, un client ou un intervalle de temps.
hu: A DNS-lekérdezés eredményhalmazának szűrése egy bizonyos tartománynál, kliensnél vagy időkeretnél.
it: Filtra i risultati in base a nome dominio, client o finestra temporale.
ja: DNS クエリの結果セットを、指定したドメインやクライアント、日時によってフィルタします。
pl: Filtruj wynik zapytania DNS ustawiony dla danej domeny, klienta lub przedziału czasu.
pt: Filtrar o resultado da Consulta DNS definido para um determinado domínio, cliente ou período.
ru: Фильтрование DNS-запросов для определенного домена, клиента или периода времени.
zh_hans: 筛选特定域，客户端或时间范围的 DNS 查询结果。

source: Flush DNS Cache
de: DNS-Cache leeren
es: Vaciar caché de DNS
fr: Vider le cache DNS
hu: DNS gyorsítótár kiürítése
it: Pulisci Cache DNS
ja: DNS キャッシュのクリア
pl: Opróżnij pamięć podręczną DNS
pt: Limpar o cache de DNS
ru: Очистка кэша DNS
zh_hans: 清空 DNS 缓存

source: Flush DNS Cache after adblock processing.
de: Leeren des DNS-Caches nach der Adblockverarbeitung.
es: Vaciar el caché de DNS después del procesamiento de adblock.
fr: Vider le cache du DNS après l'exécution du bloqueur de publicité.
hu: DNS gyorsítótár kiürítése a reklámblokkolás feldolgozása után.
ja: Adblock 処理の後に DNS キャッシュをクリアします。
pt: Limpar o cache do DNS após o processamento pelo adblock.
ru: Очистка DNS-кэша после обработки Adblock-ом.
zh_hans: 在 adblock 进程启动后清空 DNS 缓存。

source: For further information <a href="%s" target="_blank">check the online documentation</a>
de: Für weitere Informationen <a href="%s" target="_blank">lesen Sie die Online-Dokumentation</a>
es: Para obtener más información <a href="%s" target="_blank">consulte la documentación en línea</a>
fr: Pour plus d'informations, <a href="%s" target="_blank">veuillez consulter la documentation en ligne</a>
hu: További információkért <a href="%s" target="_blank">nézze meg a kézikönyvet az interneten</a>
it: Per saperne di più, <a href="%s" target="_blank">consultare la documentazione su internet</a>
ja: 詳細な情報は <a href="%s" target="_blank">オンライン ドキュメント</a> を確認してください。
pl: Więcej informacji <a href="%s" target="_blank">znajdziesz w dokumentacji online </a>
pt: Para mais informações <a href="%s" target="_blank">veja a documentação online</a>
ru: <br />Для получения дополнительной информации <a href="%s" target="_blank"> смотрите онлайн документацию</a>.
zh_hans: 进一步信息<a href="%s" target="_blank">请访问在线文档</a>

source: For further performance improvements you can raise this value, e.g. '8' or '16' should be safe.
de: Für weitere Leistungssteigerungen können Sie diesen Wert erhöhen, z.B. "8" oder "16" sollte sicher sein.
es: Para otras mejoras de rendimiento, puede aumentar este valor, por ejemplo, '8' o '16' deben ser seguros.
fr: Pour d'autres améliorations des performances, vous pouvez augmenter cette valeur, par exemple, « 8 » ou « 16 » devrait être correct.
hu: További teljesítmény-növelésért megemelheti ezt az értéket, például „8” vagy „16” biztonságos lesz.
it: Per mingliorare le performance in futuro puoi aumentare questo valore, '8' o '16' dovrebbero essere sicuri.
ja: パフォーマンスの更なる改善のため、安全と思われる '8' や '16' などの値に引き上げることができます。
pl: W celu poprawy wydajności możesz zwiększyć tę wartość, np. '8' lub '16' powinny być bezpieczne.
pt: Para melhorar o desempenho ainda mais, pode aumentar este valor, por exemplo, '8' ou '16' devem ser seguros.
ru: <br />Для повышения производительности вы можете увеличить это значение, например значения '8' или '16' должны быть безопасными.
zh_hans: 为了进一步提高性能，您可以提高此值，例如：8 或 16 应该是安全的。

source: Force Local DNS
de: Lokales DNS erzwingen
es: Forzar DNS local
fr: Forcer le DNS local
hu: Helyi DNS kényszerítése
it: Forza DNS Locale
ja: ローカル DNS の強制
pl: Wymuś lokalny DNS
pt: Forçar o DNS Local
ru: Локальный DNS
zh_hans: 强制本地 DNS

source: Full path to the blacklist file.
de: Vollständiger Pfad zur Datei der Negativliste.
es: Ruta completa al archivo de la lista negra.
fr: Chemin complet vers le fichier de liste noire.
hu: Teljes útvonal a feketelistafájlhoz.
it: Percorso completo del file di lista di blocco.
ja: ブラックリスト ファイルへのフルパスです。
pl: Pełna ścieżka do pliku czarnej listy.
pt: Caminho completo para o ficheiro da lista negra.
ru: Полное расписание пути к файлу чёрного списка.
zh_hans: 黑名单文件的完整路径。
