Repository: openwrt/openwrt
Catalog: feeds/luci/applications/luci-app-adblock/po/*/adblock.po
Languages: de, es, fr, hu, it, ja, pl, pt, ru, zh_hans

source: Full path to the whitelist file.
de: Vollständiger Pfad zur Datei der Positivliste.
es: Ruta completa al archivo de la lista blanca.
fr: Chemin complet vers le fichier de liste blanche.
hu: Teljes útvonal a fehérlistafájlhoz.
it: Percorso completo del file della whitelist.
ja: ホワイトリスト ファイルへのフルパスです。
pl: Pełna ścieżka do pliku białej listy.
pt: Caminho completo para o ficheiro da lista de permissões.
ru: Полный путь к файлу Белого списка.
zh_hans: 白名单文件的全路径。

source: Gather dns related network traffic via tcpdump to provide a DNS Query Report on demand.
es: Reúne el tráfico de red relacionado con DNS a través de tcpdump para proporcionar un informe de consulta de DNS a pedido.
hu: A DNS-re vonatkozó hálózati forgalom begyűjtése tcpdump használatával egy DNS-lekérdezési jelentés igény szerinti biztosításához.
ja: tcpdump によって DNS 関連のネットワークトラフィックを収集し、 オンデマンドのDNS クエリレポートを提供します。
pt: Reúna o tráfego de rede relacionado a dns via tcpdump para fornecer um Relatório de Consulta de DNS sob demanda.
zh_hans: 通过 tcpdump 收集 dns 有关的网络流量，以按需提供 DNS 查询报告。

source: Input file not found, please check your configuration.
de: Eingabedatei nicht gefunden, bitte überprüfen Sie Ihre Konfiguration.
es: Archivo de entrada no encontrado, por favor revise su configuración.
fr: Fichier d'entrée introuvable, veuillez vérifier votre configuration.
hu: A bemeneti fájl nem található, ellenőrizze a beállítást.
it: File di input non trovato, per favore controlla la tua configurazione.
ja: 入力ファイルが見つかりません。設定を確認してください。
pl: Nie znaleziono pliku wejściowego, proszę sprawdzić swoją konfigurację.
pt: Ficheiro de entrada não encontrado, por favor verifique a sua configuração.
ru: Config файл не найден, пожалуйста, проверьте ваши настройки.
zh_hans: 未找到输入文件，请检查您的配置。

source: Last Run
de: Letzter Lauf
es: Último inicio
fr: Dernière exécution
hu: Utolsó futás
it: Ultimo Avvio
ja: 最終実行
pl: Ostatnie uruchomienie
pt: Última Execução
ru: Последний запуск
zh_hans: 最后运行

source: Latest DNS Queries
de: Aktuellste DNS Abfragen
es: Últimas consultas de DNS
fr: Dernières requêtes DNS
hu: Legutóbbi DNS-lekérdezések
it: Ultime richieste DNS
ja: 最新の DNS クエリ
pl: Ostatnie zapytania DNS
pt: Últimas Consultas de DNS
ru: Свежие DNS запросы
zh_hans: 最新的 DNS 查询

source: List of available network interfaces. Usually the startup will be triggered by the 'wan' interface.
de: Liste der verfügbaren Netzwerkschnittstellen. Normalerweise wird der Start durch die 'wan'-Schnittstelle ausgelöst.
es: Lista de interfaces de red disponibles. Por lo general, el inicio se activará mediante la interfaz 'wan'.
fr: Liste des interfaces réseau disponibles. Le démarrage est normalement déclenché par l'interface 'wan'.
hu: Az elérhető hálózati csatolók listája. Általában az indítást a „wan” csatoló fogja aktiválni.
it: Elenco delle interfacce di rete disponibili. Di solito l'avvio verrà attivato dall'interfaccia 'wan'.
ja: 利用可能なネットワーク インターフェースの一覧です。通常、スタートアップは 'wan' インターフェースによってトリガされます。
pl: Lista dostępnych interfejsów sieciowych. Zazwyczaj uruchomienie zostanie wywołane przez interfejs 'wan'.
pt: Lista de interfaces de rede disponíveis. Normalmente a inicialização será acionada pela interface 'wan'.
ru: Список доступных сетевых интерфейсов. Обычно запускается ‘wan’ интерфейсом.
zh_hans: 可用网络接口列表。通常启动将由“wan”接口触发。

source: List of supported DNS backends with their default list export directory.
de: Liste der unterstützten DNS-Backends mit dem Standardexportverzeichnis der Liste.
es: Lista de backends DNS admitidos con su directorio de exportación de lista predeterminado.
fr: Liste des backends DNS supportés avec leur répertoire d'export de liste par défaut.
hu: A támogatott DNS háttérprogramok listája az alapértelmezett listaexportálási könyvtáraikkal.
it: Elenco di backend DNS supportati con la directory di esportazione dell'elenco predefinito.
ja: サポートされる DNS バックエンドと、それぞれのデフォルトのリスト出力先の一覧です。
pl: Lista obsługiwanych zapleczy DNS z domyślnym katalogiem eksportu list.
pt: Lista de backends DNS suportados com o seu diretório predefinido de exportação de lista.
ru: Список поддерживаемых бэкэндов DNS с каталогом экспортных директорий по умолчанию.
zh_hans: 支持的 DNS 后端服务列表及其默认列表导出目录。

source: List of supported DNS blocking variants. By default 'nxdomain' will be used for all DNS backends.
de: Liste der unterstützten DNS-Blockierungsvarianten. Standardmäßig wird 'nxdomain' für alle DNS-Backends verwendet.
es: Lista de variantes de bloqueo de DNS compatibles. Por defecto, 'nxdomain' se usará para todos los servidores DNS.
fr: Liste des variantes de blocage DNS prises en charge. Par défaut, 'nxdomain' sera utilisé pour tous les backends DNS.
hu: A támogatott DNS blokkolási változatok listája. Alapértelmezetten az „nxdomain” lesz használva az összes DNS háttérprogramnál.
it: Elenco delle varianti di blocco DNS supportate. Per impostazione predefinita, 'nxdomain' verrà utilizzato per tutti i backend DNS.
ja: DNS ブロック種別の一覧です。デフォルトの 'nxdomain' は全ての DNS バックエンドに使用されます。
pl: Lista obsługiwanych wariantów blokowania DNS. Domyślnie dla wszystkich zapleczy DNS będzie używana „nxdomain”.
pt: Lista de variantes de bloqueio de DNS suportadas. Por predfinição, o 'nxdomain' será usado para todos os backends DNS.
ru: Список поддерживаемых вариантов блокировки DNS. По умолчанию 'nxdomain' будет использоваться для всех DNS бэкэндов.
zh_hans: DNS 支持的拦截方法列表。默认情况下，“nxdomain”将用于所有 DNS 后端服务。

source: List of supported and fully pre-configured download utilities.
de: Liste der unterstützten und vollständig vorkonfigurierten Download-Hilfsprogramme.
es: Lista de utilidades de descarga totalmente preconfiguradas y compatibles.
fr: Liste des utilitaires de téléchargement pris en charge et entièrement pré-configurés.
hu: A támogatott és teljesen előre beállított letöltési segédprogramok listája.
it: Elenco delle utility di download supportate e completamente preconfigurate.
ja: サポートされ、かつ設定済のダウンロード ユーティリティの一覧です。
pl: Lista obsługiwanych i wstępnie skonfigurowanych narzędzi do pobierania.
pt: Lista de ferramentas de descarregamento suportadas e completamente pré-configuradas.
ru: Список поддерживаемых и полностью предварительно настроенных утилит для скачивания.
zh_hans: 支持和完全预配置的下载工具列表。

source: Loading
de: Lade
es: Cargando
fr: Chargement
hu: Betöltés
it: Caricando
ja: 読込中
pl: Ładowanie
pt: A carregar
ru: Загрузка
zh_hans: 加载中

source: Local FW/DNS Ports
de: Lokale FW/DNS-Ports
es: Puertos locales FW/DNS
fr: Ports FW/DNS locaux
hu: Helyi FW/DNS portok
it: Porte FW/DNS locali
ja: ローカル FW/DNS ポート
pl: Lokalne porty FW/DNS
pt: Portas locais de FW/DNS
ru: Локальные порты FW/DNS
zh_hans: 本地 FW/DNS 端口

source: Logfile
de: Logdatei
es: Archivo de registro
fr: Fichier de journal
hu: Naplófájl
it: File di registro
ja: ログファイル
pl: Rejestr dziennika
pt: Ficheiro de registo
ru: Журнал
zh_hans: 日志文件

source: Low Priority Service
de: Dienst mit niedriger Priorität
es: Servicio con prioridad baja
fr: Service en priorité basse
hu: Alacsony prioritású szolgáltatás
it: Serviio a bassa priorità
ja: 低優先度サービス
pl: Usługa niskopriorytetowa
pt: Serviço de Baixa Prioridade
ru: Низкий приоритет службы
zh_hans: 低优先级服务

source: Mail profile used in 'msmtp' for adblock notification E-Mails.
es: Perfil de correo utilizado en 'msmtp' para notificaciones de E-Mails de adblock.
hu: Az „msmtp”-ben használt levelezési profil a reklámblokkoló értesítési e-mailekhez.
ja: adblock 通知メールのために 'msmtp' で使用される、メール プロファイルです。
pt: Perfil de e-mail usado em 'msmtp' para e-mails de notificação do adblock.
zh_hans: adblock 发送通知邮件用的“msmtp”账户名。

source: Max. Download Queue
de: Max. Download-Warteschlange
es: Cola máxima de descarga
fr: Longueur max. de la file d'attente de téléchargement
hu: Legnagyobb letöltési sor
ja: ダウンロード キューの上限
pl: Maksymalny rozmiar kolejki pobierania
pt: Fila Max. de Descarregamentos
ru: Макс. очередь загрузки
zh_hans: 最大下载队列

source: Name / IP-Address
de: Name / IP-Adresse
es: Nombre / Dirección IP
fr: Nom / Adresse IP
hu: Név vagy IP-cím
it: Nome / Indirizzo IP
ja: 名前 / IP アドレス
pl: Nazwa/Adres IP
pt: Nome / Endereço IP
ru: Имя / IP-адрес
zh_hans: 名称 / IP 地址

source: No
de: Nein
fr: Non
hu: Nem
ja: いいえ
pl: Nie
pt: Não
ru: Нет
zh_hans: 否

source: Options for further tweaking in case the defaults are not suitable for you.
de: Optionen für weitere Optimierungen, falls die Standardeinstellungen nicht für Sie geeignet sind.
es: Opciones para ajustes adicionales en caso de que los valores predeterminados no sean adecuados para usted.
fr: Options permettant d'apporter des modifications supplémentaires au cas où les valeurs par défaut ne vous conviendraient pas.
hu: Beállítások a további finomhangoláshoz abban az esetben, ha az alapértelmezett értékek nem felelnek meg Önnek.
it: Opzioni per ulteriori modifiche in caso che quelle di default non ti sono adatte.
ja: デフォルト設定が適切でない場合、追加で設定するためのオプションです。
pl: Opcje dalszych zmian w przypadku, gdy ustawienia domyślne nie są dla ciebie wystarczające.
pt: Opções para ajustes adicionais, caso as predefinições não sejam adequadas para si.
ru: Возможные варианты детальной настройки, если значения по умолчанию не подходят для вас.
zh_hans: 在默认设置并不适合您时的额外选项。

source: Overall Domains
de: Gesamtdomänen
es: Dominios generales
fr: Domaines généraux
hu: Teljes tartományok
ja: 全体のドメイン
pl: Domen łącznie
pt: Domínios Gerais
ru: Всего доменов
zh_hans: 域名总览

source: Overview
de: Übersicht
es: Vista general
fr: Vue d\'ensemble
hu: Áttekintő
it: Riassunto
ja: 概要
pl: Przegląd
pt: Visão Geral
ru: Обзор
zh_hans: 概览

source: Please add only one domain per line. Comments introduced with '#' are allowed - ip addresses, wildcards and regex are not.
de: Bitte fügen Sie nur eine Domain pro Zeile hinzu. Kommentare, die mit '#' eingegeben werden, sind erlaubt - IP-Adressen, Wildcards und regex nicht.
es: Por favor agregue solo un dominio por línea. Los comentarios introducidos con '#' están permitidos, las direcciones IP, los comodines y las expresiones regulares no.
fr: Veuillez ajouter un seul domaine par ligne. Les commentaires sont autorisés et commencent par « # ». Les adresses IP, les caractères génériques et les expressions régulières ne le sont pas.
hu: Csak egy tartományt adjon hozzá soronként. A „#” kezdetű megjegyzések engedélyezettek – IP-címek, helyettesítő karakterek és reguláris kifejezés viszont nem.
it: Per favore aggiungi solo un dominio per linea. I commenti introdotti con '#' sono consentiti - indirizzi ip , jolly e regex non lo sono.
ja: 1行に1つのドメインを追加してください。'#' から始まるコメントを記述できますが、IP アドレスやワイルドカード、正規表現を設定値として使用することはできません。
pl: Dodaj tylko jedną domenę na wierszu. Komentarze wprowadzone za pomocą „#” są dozwolone - adresy IP, symbole wieloznaczne i wyrażenia regularne nie są dozwolone.
pt: Por favor, adicione apenas um domínio por linha. Comentários introduzidos com '#' são permitidos - endereços ip, curingas e regex não são permitidos.
ru: Добавляйте только один домен на строку. Комментарии вводятся используя '#'. IP адреса, wildcard и регулярные выражения запрещены.
zh_hans: 请每行只添加一个域。允许使用“#”开头的注释 - ip 地址、通配符和正则表达式都不允许。

source: Please edit this file directly in a terminal session.
de: Bitte bearbeiten Sie diese Datei direkt in einer Terminalsitzung.
es: Por favor, edite este archivo directamente en una sesión de terminal.
fr: Veuillez modifier ce fichier directement dans une session de terminal.
hu: Szerkessze ezt a fájlt közvetlenül egy terminál munkamenetben.
it: Per favore modifica questo file direttamente in una sessione al terminale.
ja: ターミナル セッションで直接このファイルを編集してください。
pl: Proszę edytować ten plik bezpośrednio w sesji terminala.
pt: Por favor, edite este ficheiro diretamente numa sessão de terminal.
ru: Редактируйте данный файл только в терминале.
zh_hans: 请直接在终端会话中编辑此文件。

source: Please note: this needs manual 'msmtp' package installation and setup.
de: Bitte beachten: Hierzu ist die manuelle Installation und Konfiguration des 'msmtp' Pakets erforderlich.
es: Tenga en cuenta: esto necesita la instalación y configuración del paquete 'msmtp' manual.
fr: Veuillez noter qu'il faut installer et configurer manuellement le paquet "msmtp".
hu: Ne feledje: ez kézi „msmtp” csomagtelepítést és beállítást igényel.
it: Nota: qesto richiede l installazione manuale e configurazione del macchetto 'msmtp'.
ja: 注意: これは手動での 'msmtp' パッケージのインストールとセットアップを必要とします。
pl: Uwaga: wymaga to ręcznej instalacji i konfiguracji pakietu 'msmtp'.
pt: Por favor note: isto precisa de instalação e configuração manual do pacote 'msmtp'.
ru: Обратите внимание: для этого требуется ручная установка и настройка пакета 'msmtp'.
zh_hans: 请注意：这需要手动安装和设置“msmtp”软件包。

source: Please note: this needs manual 'tcpdump-mini' package installation.
de: Bitte beachten: Dies erfordert die manuelle Installation des Pakets 'tcpdump-mini'.
es: Tenga en cuenta: esto necesita la instalación manual del paquete 'tcpdump-mini'.
fr: Veuillez noter que l'installation du paquet "tcpdump-mini" doit être effectuée manuellement.
hu: Ne feledje: ez kézi „tcpdump-mini” csomagtelepítést igényel.
ja: 注意: これは手動での 'tcpdump-mini' パッケージのインストールを必要とします。
pl: Uwaga: wymaga to ręcznej instalacji pakietu 'tcpdump-mini'.
pt: Por favor note: isto necessita da instalação manual do pacote 'tcpdump-mini'.
ru: Обратите внимание: для этого требуется ручная установка пакета 'tcpdump-mini'.
zh_hans: 请注意：这需要手动安装和设置“tcpdump-mini”软件包。

source: Query
de: Abfrage
es: Consulta
fr: Requête
hu: Lekérdezés
it: Interrogazione
ja: 検索
pl: Zapytanie
pt: Consulta
ru: Запрос
zh_hans: 查询

source: Query domains
de: Domainabfrage
es: Dominios de consulta
fr: Domaines de recherche
hu: Tartományok lekérdezése
it: Interrogazione domini
ja: ドメインの検索
pl: Domeny zapytań
pt: Consultar domínios
ru: Запрос доменов
zh_hans: 查询域

source: Raise the minimum notification count, to get E-Mails if the overall count is less or equal to the given limit (default 0),
es: Aumente el recuento mínimo de notificaciones para obtener E-Mails si el recuento general es menor o igual al límite dado (valor predeterminado 0),
hu: Emelje meg a legkisebb értesítési darabszámot, hogy megkapja az e-maileket, ha az összesített darabszám kisebb vagy egyenlő a megadott korlátnál (alapértelmezetten 0).
ja: メール通知を行うメール通知カウントを設定します。全体カウントが指定された値以下の場合、メールを受け取ります。（規定値: 0）
pt: Aumente a contagem mínima de notificações, para obter e-mails se a contagem total for menor ou igual ao limite dado (predefinição 0),
zh_hans: 如果总计数小于或等于给定的限制（默认为0），则提高最小通知计数以获取 E-Mail，

source: Receiver address for adblock notification E-Mails.
es: Dirección del receptor para la notificación de bloqueos electrónicos.
fr: Adresse du destinataire pour les e-mails de notification du bloqueur de publicité.
hu: Fogadó címe a reklámblokkoló értesítési e-mailekhez.
ja: adblock 通知メールの受信アドレスです。
pt: Endereço do destinatário para e-mails de notificação do adblock.
zh_hans: adblock 通知 E-Mail 的收件人地址。

source: Redirect all DNS queries from 'lan' zone to the local resolver, applies to udp and tcp protocol on ports 53, 853 and 5353.
es: Redireccionar todas las consultas DNS desde la zona 'lan' al resolvedor local, se aplica al protocolo udp y tcp en los puertos 53, 853 y 5353.
hu: Az összes DNS-lekérdezés átirányítása a „lan” zónából a helyi feloldóhoz, alkalmazza az UDP és TCP protokollra az 53, 853 és 5353 számú portokon.
ja: 'lan' ゾーンからの全 DNS クエリをローカル リゾルバにリダイレクトします。これは、53, 853, 5353 の各ポートにおける UDP, TCP プロトコルに適用されます。
pt: Redireccionar todas as consultas DNS da zona 'lan' para o resolvedor local, aplica-se ao protocolo udp e tcp nas portas 53, 853 e 5353.
zh_hans: 将所有 DNS 查询从“lan”区域重定向到本地解析器，包括 udp、tcp 协议的 53、853、5353 端口 。

source: Refresh
de: Aktualisieren
es: Refrescar
fr: Actualiser
hu: Frissítés
it: Ricaricare
ja: リフレッシュ
pl: Odśwież
pt: Atualizar
ru: Обновить
zh_hans: 刷新

source: Refresh Blocklist Sources
de: Aktualisieren der Blocklistenquellen
es: Actualizar las fuentes de la lista de bloqueo
fr: Actualiser les sources des listes de blocage
hu: Blokkolási lista forrásainak frissítése
it: Aggiorna fonti Blocklist
ja: ブロックリスト提供元のリフレッシュ
pl: Odśwież listę blokujących
pt: Atualizar Fontes da Lista Negra
ru: Обновить источники списков блокировок
zh_hans: 刷新拦截列表源

source: Refresh Report
de: Bericht aktualisieren
es: Informe de actualización
fr: Rafraîchir le rapport
hu: Jelentés frissítése
it: Aggiorna rapporto
ja: レポートをリフレッシュ
pl: Odśwież raport
pt: Atualizar Relatório
ru: Обновить отчет
zh_hans: 刷新报告

source: Report Chunk Count
de: Bericht Datenblock Anzahl
es: Informe de recuento de fragmentos
fr: Rapporter le nombre de morceaux
hu: Darabok számának jelentése
ja: レポート チャンクカウント
pl: Zgłoś liczbę fragmentów
pt: Relatar Contagem de Porções
ru: Количество фрагментов отчета
zh_hans: 报告区块计数

source: Report Chunk Size
de: Bericht Datenblock Größe
es: Tamaño del fragmento de informe
fr: Rapporter la taille des morceaux
hu: Darabok méretének jelentése
ja: レポート チャンクサイズ
pl: Zgłoś rozmiar fragmentu
pt: Tamanho de Porções de Relatório
ru: Размер фрагментов отчета
zh_hans: 报告区块大小

source: Report Directory
de: Berichtsverzeichnis
es: Directorio de informes
fr: Rapporter le Répertoire
hu: Könyvtár jelentése
it: Directory dei report
ja: レポート ディレクトリ
pl: Katalog raportów
pt: Diretório de Relatórios
ru: Папка для отчетов
zh_hans: 报告目录

source: Report Interface
de: Bericht Schnittstelle
es: Interfaz de informe
fr: Rapporter l'Interface
hu: Csatoló jelentése
ja: レポート インターフェース
pl: Interfejs raportowania
pt: Interface de Relatório
ru: Отчет интерфейса
zh_hans: 报告接口

source: Report Listen Port(s)
de: Bericht Listen Port(s)
es: Informe escuchar puerto(s)
fr: Rapporter le(s) Port(s) d'écoute
hu: Figyelt portok jelentése
ja: レポート待ち受けポート
pl: Raport nasłuchiwania portu(ów)
pt: Relatar Porta(s) de Escuta
ru: Порт(ы) для прослушивания отчета(ов)
zh_hans: 报告监听端口

source: Report chunk count used by tcpdump (default '5').
de: Von tcdump benutzte Blockanzahl berichten (Standardwert 5).
es: Informe de recuento de fragmentos utilizado por tcpdump (por defecto '5').
fr: Indiquez le nombre de morceaux utilisés par tcpdump (par défaut "5").
hu: A tcpdump által használt darabok számának jelentése (alapértelmezetten „5”).
it: Segnala il conteggio dei blocchi utilizzato da tcpdump (predefinito "5").
ja: tcpdump により使用される、レポートチャンク数です。（規定値: '5'）
pl: Zgłoś liczbę fragmentów używanych przez tcpdump (domyślnie "5").
pt: Relatar contagem de porções usados pelo tcpdump (padrão '5').
ru: Количество фрагментов отчета, используемых tcpdump (по умолчанию '5').
zh_hans: tcpdump 将使用的报告区块计数（默认为“5”）。

source: Report chunk size used by tcpdump in MB (default '1').
de: Von tcdump benutzte Blockanzahl in MB berichten (Standardwert '1').
es: Informe el tamaño del fragmento utilizado por tcpdump en MB (valor predeterminado '1').
fr: Indiquez la taille des morceaux utilisés par tcpdump en MB (par défaut "1").
hu: A tcpdump által használt darabok méretének jelentése megabájtban (alapértelmezetten „1”).
it: Segnala la dimensione del blocco utilizzato da tcpdump in MB (predefinito "1").
ja: tcpdump により使用される、レポート チャンクサイズです。（規定値: '1'）
pl: Zgłoś rozmiar fragmentu używanego przez tcpdump w MB (domyślnie "1").
pt: Reportar o tamanho de porções usados pelo tcpdump em MB (predefinição '1').
ru: Размер фрагмента отчета, используемый tcpdump в мегабайтах (по умолчанию '1').
zh_hans: tcpdump 将使用的报告区块大小（MB）（默认为“1”）。

source: Reporting interface used by tcpdump, set to 'any' for multiple interfaces (default 'br-lan').
de: Vom tcpdump verwendete berichtende Schnittstelle, bei mehreren Schnittstellen auf 'any' gesetzt (Standardwert 'br-lan').
es: Interfaz de informes utilizada por tcpdump, establecida en 'any' para múltiples interfaces (por defecto 'br-lan').
fr: Rapporter l'Interface utilisée par tcpdump, définie sur "any" pour les interfaces multiples (par défaut "br-lan").
hu: A tcpdump által használt csatoló számának jelentése, állítsa „any” értékre több csatolónál (alapértelmezetten „br-lan”).
it: Interfaccia di reporting utilizzata da tcpdump, impostata su "any" per più interfacce (impostazione predefinita "br-lan").
ja: tcpdump により使用される、レポートを行うインターフェースです。複数のインターフェースを使用するには、 'any' を設定してください。（規定値: 'br-lan'）
pl: Interfejs raportowania używany przez tcpdump, ustaw na 'any' dla wielu interfejsów (domyślnie 'br-lan').
pt: Interface de relatórios usada pelo tcpdump, definida como 'any' para múltiplas interfaces (predefinição 'br-lan').
ru: Интерфейс отчетов, используемый tcpdump, установлен в 'any' для нескольких интерфейсов (по умолчанию 'br-lan').
zh_hans: tcpdump 使用的报告接口，对于多个接口设置为“any”（默认为“br-lan”）。

source: Resets the final DNS blockfile 'adb_list.overall' after loading through the DNS backend.
de: Setzt die endgültige DNS-Blockdatei 'adb_list.overall' zurück, nachdem sie über das DNS-Backend geladen wurde.
es: Restablece el archivo de bloque DNS final 'adb_list.overall' después de cargarlo a través del backend de DNS.
fr: Réinitialise le fichier de blocage DNS final "adb_list.overall" après le chargement par le backend DNS.
hu: Visszaállítja a végső „adb_list.overall” DNS blokkolási fájlt a DNS háttérprogramon keresztül történő betöltés után.
ja: 最終的な DNS ブロックファイル 'adb_list.overall' を、DNS バックエンドを通して読み込み後にリセットします。
pl: Resetuje końcowy plik blokowania DNS 'adb_list.overall' po wczytaniu go przez zaplecze DNS.
pt: Repõe o ficheiro de bloco DNS final 'adb_list.overall' após carregar através do backend DNS.
ru: Сбрасывает последний блок-файл DNS 'adb_list.overall' после нагрузки через DNS сервер.
zh_hans: DNS 后端加载完毕后，重置最终的 DNS 拦截文件“adb_list.overall”。

source: Resume
de: Wiederaufnehmen
es: Reanudar
fr: Reprendre
hu: Folytatás
it: Riprendi
ja: 再開
pl: Wznów
pt: Continuar
ru: Возобновить
zh_hans: 恢复

source: Runtime Information
de: Laufzeitinformationen
es: Información de tiempo de ejecución
fr: Information processus
hu: Futtatókörnyezet-információk
it: Informazione di Runtime
ja: ランタイム情報
pl: Informacja o środowisku uruchomieniowym
pt: Informação sobre a Execução
ru: Информация о состоянии
zh_hans: 运行信息

source: SSL req.
de: SSL-Anf.
es: Req. SSL
fr: Requête SSL
hu: SSL kérés
it: Ric. SSL
ja: SSL 必須
pl: Wymóg SSL
pt: Req. de SSL
ru: Запрос SSL
zh_hans: SSL请求。

source: Save
de: Speichern
es: Guardar
fr: Enregistrer
hu: Mentés
it: Salva
ja: 保存
pl: Zapisz
pt: Guardar
ru: Сохранить
zh_hans: 保存

source: Send notification E-Mails in case of a processing error or if domain count is &le; 0.
es: Enviar notificaciones por E-Mail en caso de un error de procesamiento o si el recuento de dominios es &le 0.
hu: Értesítési e-mailek küldése feldolgozási hiba esetén, vagy ha a tartomány darabszáma kisebb mint 0.
ja: 処理エラーまたはドメイン カウントが 0 以下の場合、通知メールを送信します。
pt: Enviar e-mails de notificação em caso de erro de processamento ou se a contagem de domínios for &le; 0.
zh_hans: 如果发生处理错误或域名数 &le; 0，则发送通知 E-Mail。

source: Sender address for adblock notification E-Mails.
es: Dirección del remitente para los E-Mails de notificación de adblock.
hu: Küldő címe a reklámblokkoló értesítési e-mailekhez.
ja: adblock 通知メールの送信アドレスです。
pt: Endereço do remetente para e-mails de notificação adblock.
zh_hans: adblock 通知 E-Mail 的发件人地址。
