Repository: openwrt/openwrt
Catalog: feeds/luci/applications/luci-app-adblock/po/*/adblock.po
Languages: de, es, fr, hu, it, ja, pl, pt, ru, zh_hans

source: Set the nice level to 'low priority' and the adblock background processing will take fewer resources from the system.
de: Stellen Sie den nice-level auf 'niedrige Priorität' und die Adblock-Hintergrundverarbeitung wird weniger Ressourcen vom System benötigen.
es: Establezca el nivel agradable en 'prioridad baja' y el procesamiento en segundo plano de Adblock tomará menos recursos del sistema.
fr: Si vous réglez le niveau clémence sur "priorité basse", le traitement en arrière-plan d'adblock consommera moins de ressources du système.
hu: Állítsa a nice szintet „alacsony prioritásra”, és a reklámblokkoló háttérfeldolgozása kevesebb erőforrást fog elvenni a rendszertől.
it: Imposta il buon livello su "bassa priorità" e l'elaborazione in background del blocco degli annunci richiederà meno risorse dal sistema.
ja: nice値（優先度）を '低優先度' に設定し、adblock バックグラウンド処理のシステムリソース使用量を抑制します。
pl: Ustawia niski priorytet procesu za pomocą polecenia 'nice', dzięki czemu przetwarzanie w tle zajmie mniej zasobów systemu.
pt: Define o nível de nice para 'baixa prioridade' e o processamento em segundo plano do adblock irá retirar menos recursos do sistema.
ru: Установить приоритет задачи на "низкий" для уменьшения потребляемых ресурсов системы.
zh_hans: 设置 nice 级别为“低优先级”，adblock 后台进程将从系统中获取更少的资源。

source: Size of the download queue to handle downloads &amp; list processing in parallel (default '4').
de: Größe der Download-Warteschlange für die parallele Verarbeitung von Downloads und Listen (Standard'4').
es: Tamaño de la cola de descarga para manejar descargas &amp; procesamiento de la lista en paralelo (predeterminado '4').
fr: Taille de la file d'attente de téléchargement pour traiter les téléchargements &amp; traitement en parallèle de la liste (par défaut "4").
hu: A letöltési sor mérete a letöltések és a listafeldolgozás párhuzamos kezeléséhez (alapértelmezetten „4”).
ja: ダウンロードの制御とリストの処理を同時並行的に行う、ダウンロードキューのサイズです。（規定値: '4'）
pl: Rozmiar kolejki pobierania do obsługi pobrań; równoległe przetwarzanie list (domyślnie '4').
pt: Tamanho da fila de descarregamento para lidar com descarregamentos &amp; processamento de lista em paralelo (predefinição '4').
ru: Размер очереди параллельных загрузок &amp; ('4' по умолчанию).
zh_hans: 下载队列的大小，用于并行下载 &amp; 列表处理（默认为“4”）。

source: Space separated list of firewall ports which should be redirected locally.
de: Leerzeichengetrennte Liste der Firewall-Ports, die lokal umgeleitet werden sollen.
es: Lista de puertos de firewall separados por espacios que deben redirigirse localmente.
fr: Liste séparée par des espaces des ports du pare-feu qui doivent être redirigés localement.
hu: Azoknak a tűzfal portoknak a szóközzel elválasztott listája, amelyeket helyileg kell átirányítani.
it: Elenco separato da spazi di porte firewall che devono essere reindirizzate localmente.
ja: スペースで区切られた、ローカルにリダイレクトされるファイアウォール ポートのリストです。
pl: Rozdzielona spacjami lista portów zapory, które powinny być przekierowywane lokalnie.
pt: Lista separada por espaço de portas de firewall que devem ser redirecionadas localmente.
ru: Разделенный пробелом список портов брандмауэра, которые должны быть перенаправлены локально.
zh_hans: 应被防火墙重定向到本地的端口列表，使用空格分隔。

source: Space separated list of reporting port(s) used by tcpdump (default: '53').
de: Leerzeichengetrennte Liste der von tcpdump verwendeten berichtende Ports (Standardwert: '53').
es: Lista separada por espacios de los puertos de informe utilizados por tcpdump (predeterminado: '53').
fr: Liste séparée par des espaces du ou des ports utilisés par tcpdump (par défaut : "53").
hu: A tcpdump által használt jelentési portok szóközzel elválasztott listája (alapértelmezett: „53”).
ja: tcpdump により使用される、レポートを行うポートのスペースで区切られたリストです。（規定値: '53'）
pl: Rozdzielona spacjami lista portu(ów) używanych przez tcpdump (domyślnie: '53').
pt: Lista separada por espaço de portas relatórias usada pelo tcpdump (predefinição: '53').
ru: Разделенный пробелом список портов для отчетов, используемых tcpdump (по умолчанию: '53').
zh_hans: tcpdump 使用的报告端口列表，使用空格分隔（默认值：“53”）。

source: Start Date
de: Startdatum
es: Fecha de inicio
fr: Date de début
hu: Kezdődátum
ja: 開始日
pl: Data rozpoczęcia
pt: Data de Início
ru: Дата начала
zh_hans: 开始日期

source: Startup Trigger
es: Disparador de inicio
fr: Déclencheur de démarrage
hu: Indítási aktiváló
it: Innesco d'Avvio
ja: スタートアップ トリガ
pl: Wyzwalacz uruchomienia
pt: Gatilho de Inicialização
ru: Автозапуск после
zh_hans: 启动触发器

source: Suspend
de: Aussetzen
es: Suspender
fr: Mettre en pause
hu: Felfüggesztés
it: Sospendi
ja: 一時停止
pl: Zawieś
pt: Suspender
ru: Приостановить
zh_hans: 暂停

source: Suspend / Resume Adblock
de: Adblock Aussetzen / Wiederaufnehmen
es: Suspender / Reanudar Adblock
fr: Mettre en pause / Reprendre le blocage de publicité
hu: Reklámblokkolás felfüggesztése vagy folytatása
it: Sospendi / Riprendi Adblock
ja: Adblock の一時停止 / 再開
pl: Zawieś/Wznów Adblocka
pt: Suspender / Continuar Adblock
ru: Приостановить / Возобновить Adblock
zh_hans: 暂停/恢复 Adblock

source: TLD Compression Threshold
de: TLD-Kompressionsschwellenwert
es: Umbral de compresión de TLD
fr: Seuil de compression des TLD
hu: TLD tömörítésének küszöbszintje
ja: TLD 圧縮閾値
pl: Próg kompresji TLD
pt: Limiar de Compressão TLD
ru: Степень сжатия TLD
zh_hans: TLD 压缩阈值

source: Target directory for adblock source backups. Default is '/tmp', please use preferably a non-volatile disk if available.
de: Zielverzeichnis für Adblock-Quelldatensicherungen. Standardwert ist'/tmp', bitte verwenden Sie vorzugsweise eine nichtflüchtige Festplatte, falls vorhanden.
es: Directorio de destino para copias de seguridad de origen de adblock. El valor predeterminado es '/tmp', utilice preferiblemente un disco no volátil si está disponible.
fr: Répertoire cible pour les sauvegardes des sources adblock. La valeur par défaut est '/tmp', veuillez utiliser de préférence un disque non volatil si disponible.
hu: Célkönyvtár a reklámblokkoló forrásának biztonsági mentéseihez. Alapértelmezetten „/tmp”, használjon inkább tartósan megmaradó lemezt, ha elérhető.
ja: adblock ソースをバックアップする対象ディレクトリです。デフォルトは '/tmp' ですが、可能であれば不揮発性ディスクを使用して下さい。
pl: Katalog docelowy kopii zapasowych źródeł adblocka. Domyślnie jest to '/tmp', najlepiej użyć nieulotnego dysku, jeśli jest dostępny.
pt: Diretório de destino para backups de fontes adblock. A predifnição é '/tmp', por favor use preferencialmente um disco não volátil se disponível.
ru: Место размещения резервного списка блокировок. По умолчанию '/tmp', по возможности необходимо использовать энергонезависимый диск.
zh_hans: adblock 源备份的目标目录。默认值为“/tmp”，请尽可能使用非易失性磁盘。

source: Target directory for dns related report files. Default is '/tmp', please use preferably a non-volatile disk if available.
de: Zielverzeichnis für DNS-bezogene Berichtsdateien. Standard ist '/tmp', bitte vorzugsweise einen nichtflüchtigen Speicherort verwenden, falls vorhanden.
es: Directorio de destino para archivos de informes relacionados con dns. El valor predeterminado es '/tmp', utilice preferiblemente un disco no volátil si está disponible.
fr: Répertoire cible pour les fichiers de rapport relatifs aux DNS. La valeur par défaut est '/tmp', veuillez utiliser de préférence un disque non volatil si disponible.
hu: Célkönyvtár a DNS-hez kapcsolódó jelentési fájlokhoz. Alapértelmezetten „/tmp”, használjon inkább tartósan megmaradó lemezt, ha elérhető.
ja: DNS 関連レポート ファイルの保存先ディレクトリです。デフォルトは '/tmp' ですが、可能であれば不揮発性ディスクを使用してください。
pl: Katalog docelowy dla plików raportów związanych z DNS. Domyślnie jest to '/tmp', najlepiej użyć nieulotnego dysku, jeśli jest dostępny.
pt: Diretório de destino para ficheiros de relatório relacionados a dns. A predefinição é '/tmp', por favor use preferencialmente um disco não volátil se disponível.
ru: Целевой каталог для файлов отчетов, связанных с dns.. По умолчанию '/tmp', по возможности необходимо использовать энергонезависимый диск.
zh_hans: 与 dns 相关的报告文件的目标目录。默认值为“/tmp”，请尽可能使用非易失性磁盘。

source: Target directory for the generated blocklist 'adb_list.overall'.
de: Zielverzeichnis für die generierte Blockliste 'adb_list.overall'.
es: Directorio de destino para la lista de bloqueo generada 'adb_list.overall'.
fr: Répertoire cible pour la liste de blocage générée "adb_list.overall".
hu: Célkönyvtár az előállított „adb_list.overall” blokkolási listához.
it: Directory per la lista di blocco generata 'adb_list.overall'.
ja: 生成されたブロックリスト 'adb_list.overall' の保存先ディレクトリです。
pl: Katalog docelowy dla wygenerowanej listy blokowania 'adb_list.overall'.
pt: Diretório de destino para a lista de blocos 'adb_list.overall' gerada .
ru: Папка для созданного списка блокировки 'adb_list.overall'.
zh_hans: 生成拦截列表“adb_list.overall”的目标目录。

source: The file size is too large for online editing in LuCI (&ge; 100 KB).
de: Die Größe der Datei ist für die Onlinebearbeitung in LuCI zu groß (&ge; 100 KB).
es: El tamaño del archivo es demasiado grande para la edición en línea en LuCI (&ge; 100 KB).
fr: La taille du fichier est trop grande pour l'édition dans LUCI (&ge; 100 Ko).
hu: A fájlméret túl nagy a LuCI-ban történő internetes szerkesztéshez (nagyobb mint 100 KB).
ja: LuCI上でのオンライン編集を行うには、ファイルサイズが大きすぎます (&ge; 100 KB)。
pl: Rozmiar pliku jest zbyt duży do edycji online w LuCI (&ge; 100 KB).
pt: O tamanho do ficheiro é demasiado grande para editar online em LuCI (&ge; 100 KB).
ru: Этот файл слишком большой для редактирования в Web-интерфейсе LuCI (&ge; 100 KB).
zh_hans: 文件过大，无法使用 LuCI 的在线编辑（&ge; 100 KB）。

source: The syslog output, pre-filtered for adblock related messages only.
de: Die Syslog-Ausgabe, vorgefiltert nur für adblockbezogene Nachrichten.
es: La salida de syslog, prefiltrada solo para mensajes relacionados con adblock.
fr: La sortie syslog, pré-filtrée pour les messages liés à adblock uniquement.
hu: A rendszernapló kimenete, előre szűrve csak a reklámblokkolóhoz kapcsolódó üzenetekhez.
it: L'output di syslog, pre-filtrato solo per i messaggi relativi ad adblock.
ja: Adblock に関連するメッセージのみが抽出された、システムログ出力です。
pl: Dane wyjściowe dziennika systemowego, wstępnie przefiltrowane dla informacji związanych z adblockiem.
pt: A saída do syslog, pré-filtrada somente para mensagens relacionadas ao adblock.
ru: Вывод системного журнала, предварительно отфильтрованный только для сообщений, связанных с adblock.
zh_hans: 系统日志输出，仅针对 adblock 相关的消息进行了预筛选。

source: This change requires a manual service stop/re-start to take effect.
de: Diese Änderung erfordert ein manueller Stop/Neustart des Diensts zum Wirksam werden.
es: Este cambio requiere una parada/reinicio manual del servicio para que tenga efecto.
fr: Ce changement nécessite un arrêt/redémarrage manuel du service pour prendre effet.
hu: Ez a változtatás a szolgáltatás kézi leállítását vagy újraindítását igényli az életbe léptetéshez.
it: Per rendere effettiva questa modifica è necessario arrestare/riavviare il servizio manualmente.
ja: この変更の反映には、手動でのサービスの停止 / 再起動が必要です。
pl: Ta zmiana wymaga ręcznego zatrzymania/ponownego uruchomienia usługi, aby została uwzględniona.
pt: Esta alteração requer uma paragem/reinicialização manual do serviço para ter efeito.
ru: Это изменение требует ручной остановки и повторного запуска, чтобы вступить в силу.
zh_hans: 此更改需要手动停止/重新启动服务才能生效。

source: This form allows you to modify the content of the adblock blacklist (%s).
de: Mit diesem Formular können Sie den Inhalt der Adblock-Blacklist (%s) ändern.
es: Este formulario le permite modificar el contenido de la lista negra de adblock (%s).
fr: Ce formulaire vous permet de modifier le contenu de a liste noire du bloqueur de publicité (%s).
hu: Ez az űrlap lehetővé teszi a reklámblokkoló feketelista tartalmának módosítását (%s).
it: Questo modulo consente di modificare il contenuto della lista nera di blocco degli annunci (%s).
ja: このフォームでは、Adblock ブラックリスト (%s) の内容を変更することができます。
pl: Ten formularz umożliwia modyfikowanie zawartości czarnej listy adblocka (%s).
pt: Este formulário permite-lhe modificar o conteúdo da lista negra do adblock (%s).
ru: Эта форма позволяет изменять содержимое черного списка adblock (%s).
zh_hans: 此表单允许您修改 adblock 黑名单（%s）的内容。

source: This form allows you to modify the content of the adblock whitelist (%s).
de: Mit diesem Formular können Sie den Inhalt der Adblock-Positivliste (%s) ändern.
es: Este formulario le permite modificar el contenido de la lista blanca de adblock (%s).
fr: Ce formulaire vous permet de modifier le contenu de la liste blanche du bloqueur de publicité (%s).
hu: Ez az űrlap lehetővé teszi a reklámblokkoló fehérlista tartalmának módosítását (%s).
it: Questo modulo consente di modificare il contenuto della whitelist di blocco degli annunci (%s).
ja: このフォームでは、Adblock ホワイトリスト (%s) の内容を変更することができます。
pl: Ten formularz umożliwia modyfikowanie zawartości białej listy adblocka (%s).
pt: Este formulário permite-lhe modificar o conteúdo da lista de permissão do adblock (%s).
ru: Эта форма позволяет изменять содержимое белого списка adblock (%s).
zh_hans: 此表单允许您修改 adblock 白名单（%s）的内容。

source: This form allows you to modify the content of the main adblock configuration file (/etc/config/adblock).
de: Dieses Formular ermöglicht es Ihnen, den Inhalt der Hauptkonfigurationsdatei von Adblock (/etc/config/adblock) zu ändern.
es: Este formulario le permite modificar el contenido del archivo de configuración principal de adblock (/etc/config/adblock).
fr: Ce formulaire vous permet de modifier e contenu du fichier de configuration principal du bloqueur de publicité (/etc/config/adblock).
hu: Ez az űrlap lehetővé teszi a fő reklámblokkoló beállítófájl tartalmának módosítását (/etc/config/adblock).
it: Questo form ti consente di modificare il contenuto del file principale di configurazione di adblock (/etc/config/adblock).
ja: このフォームでは、メインのAdblock 設定ファイル (/etc/config/adblock) の内容を変更することができます。
pl: Ten formularz pozwala na modyfikację zawartości głównego pliku konfiguracyjnego adblocka (/etc/config/adblock).
pt: Este formulário permite que modifique o conteúdo do ficheiro principal de configuração do adblock (/etc/config/adblock).
ru: Данное поле позволяет изменять содержимое config файла Adblock-a (/etc/config/adblock).
zh_hans: 此表单允许您修改主要 adblock 配置文件（/etc/config/adblock）的内容。

source: This form allows you to query active block lists for certain domains, e.g. for whitelisting.
de: Mit diesem Formular können Sie aktive Blocklisten für bestimmte Domänen abfragen, z.B. zum positiv listen.
es: Este formulario le permite consultar listas de bloqueo activas para ciertos dominios, por ejemplo, para la lista blanca.
fr: Ce formulaire vous permet d'interroger des listes de blocage actives pour certains domaines, par exemple pour la liste blanche.
hu: Ez az űrlap lehetővé teszi az aktív blokkolási listák lekérdezését bizonyos tartományokhoz, például fehérlistázáshoz.
it: Questo form ti consente di interrogare le liste di blocco attive per determinati domini, p.e. per metterli nella lista bianca.
ja: このフォームでは、現在有効なリスト内で特定のドメインを検索することができます。例: ホワイトリスト内
pl: Formularz ten pozwala na przeszukanie aktywnych list blokowania dla pewnych domen, np. w celu dodania do białej listy.
pt: Este formulário permite-lhe consultar listas de blocos ativas para determinados domínios, por exemplo, para listas brancas.
ru: Данное поле позволяет запросить домены для конкретных списков, например для Белого списка.
zh_hans: 此表单允许您查询某些域的活动块列表，例如用于列出白名单。

source: This option saves an enormous amount of storage space, but starts a small ubus/adblock monitor in the background.
de: Diese Option spart enorm viel Speicherplatz, startet aber einen kleinen ubus/adblock-Monitor im Hintergrund.
es: Esta opción ahorra una enorme cantidad de espacio de almacenamiento, pero inicia un pequeño monitor ubus/adblock en segundo plano.
fr: Cette option économise une énorme quantité d'espace de stockage, mais démarre un petit moniteur ubus / adblock en arrière-plan.
hu: Ez a beállítás hatalmas mennyiségű tárolóhelyet spórol meg, de egy kis ubus/adblock megfigyelést indít a háttérben.
it: Questa opzione consente di risparmiare un'enorme quantità di spazio di archiviazione, ma avvia un piccolo monitor ubus/adblock in background.
ja: このオプションはストレージ容量の大きな節約となりますが、バックグラウンドで小さな ubus/adblock モニターを開始します。
pl: Ta opcja pozwala zaoszczędzić ogromną ilość miejsca na dysku, ale uruchamia niewielki proces monitorujący ubus w tle.
pt: Esta opção poupa uma enorme quantidade de espaço de armazenamento, mas inicia um pequeno monitor ubus/adblock em segundo plano.
ru: Эта опция экономит огромное количество места для хранения, но запускает небольшой мониторинг ubus/adblock в фоновом режиме.
zh_hans: 此选项可节省大量存储空间，但要在后台启动一个小型 ubus/adblock 监视器。

source: Time
de: Zeit
es: Hora
fr: Heure
hu: Idő
ja: 時刻
pl: Czas
pt: Tempo
ru: Время
zh_hans: 时间

source: To overwrite the default path use the 'DNS Directory' option in the extra section below.
de: Um den Standardpfad zu überschreiben, verwenden Sie die Option 'DNS Directory' im zusätzlichen Abschnitt unten.
es: Para sobrescribir la ruta predeterminada, use la opción 'Directorio DNS' en la sección adicional a continuación.
fr: Pour remplacer le chemin par défaut, utilisez l'option «Répertoire DNS» dans la section supplémentaire ci-dessous.
hu: Az alapértelmezett útvonal felülírásához használja a „DNS könyvtár” beállítást a lenti további szakaszban.
it: Per sovrascrivere il percorso di default usa l'opzione 'Directory DNS' nella sezione aggiuntiva sotto.
ja: デフォルトのパスを上書きするには、下記拡張セクションの 'DNS ディレクトリ' オプションを使用します。
pl: Aby nadpisać ścieżkę domyślną użyj opcji 'Katalog DNS' w sekcji dodatkowej poniżej.
pt: Para sobrescrever o caminho predfinido, use a opção 'DNS Directory' na secção adicional abaixo.
ru: Чтобы заменить путь по умолчанию, используйте пункт 'Папка DNS' в разделе 'Дополнительные настройки'.
zh_hans: 要覆盖默认路径，请使用下面额外部分中的“DNS 目录”选项。

source: Top 10 Reporting
de: Top 10 der Berichterstattung
es: Top 10 de informes
fr: Top 10 des rapports
hu: Leggyakoribb 10 jelentés
ja: 上位 10 レポート
pl: Top 10 Raportów
pt: Os 10 Relatórios Principais
ru: Топ-10 Отчетов
zh_hans: 前十报告

source: Topic for adblock notification E-Mails.
es: Tema para la notificación de bloqueos de E-Mails.
hu: Téma a reklámblokkoló értesítési e-mailekhez.
ja: adblock 通知メールの題名です。
pt: Tópico para e-mails de notificação adblock.
zh_hans: adblock 通知 E-Mail 的主题。

source: Total DNS Queries
de: Gesamtzahl der DNS-Abfragen
es: Total de consultas de DNS
fr: Nombre total de Requêtes DNS
hu: Összes DNS-lekérdezés
ja: 総 DNS クエリ
pl: Całkowita liczba zapytań DNS
pt: Total de Consultas DNS
ru: Всего запросов DNS
zh_hans: DNS 查询总数

source: Trigger Delay
de: Auslöseverzögerung
es: Retraso de disparo
fr: Délai de déclenchement
hu: Aktiváló késleltetése
it: Ritardo Innesco
ja: トリガ遅延
pl: Opóźnienie wyzwalacza
pt: Atraso do Gatilho
ru: Задержка запуска
zh_hans: 触发延迟

source: Verbose Debug Logging
de: Ausführliche Debug-Protokollierung
es: Registro de depuración detallado
fr: Logs en mode verbeux
hu: Részletes hibakeresési naplózás
it: Registro di Debug Dettagliato
ja: 詳細なデバッグ ログ
pl: Pełne rejestrowanie debugowania
pt: Registro de Depuração Detalhado
ru: Подробный журнал отладки
zh_hans: 详细的调试记录

source: Waiting for command to complete...
de: Der Befehl wird ausgeführt...
es: Esperando a que se complete el comando...
fr: En attente que la commande se termine…
hu: Várakozás a parancs befejeződésére…
it: Aspettando che il comando venga completato...
ja: コマンド実行中です...
pl: Oczekiwanie na polecenie do wykonania...
pt: A aguardar que o comando termine...
ru: Ожидание завершения выполнения команды...
zh_hans: 正在等待命令完成…

source: Whitelist
de: Positivliste
es: Lista blanca
fr: Liste blanche
hu: Fehérlista
it: Lista bianca
ja: ホワイトリスト
pl: Biała lista
pt: Lista de Permissões
ru: Белый список
zh_hans: 白名单

source: Whitelist File
de: Positivlistendatei
es: Archivo de lista blanca
fr: Fichier de liste blanche
hu: Fehérlistafájl
it: File lista bianca
ja: ホワイトリスト ファイル
pl: Plik białej listy
pt: Ficherio da Lista De Permissões
ru: Файл Белого списка
zh_hans: 白名单文件

source: Yes
de: Ja
es: Si
fr: Oui
hu: Igen
it: Sì
ja: はい
pl: Tak
pt: Sim
ru: Да
zh_hans: 是

source: e.g. to receive an E-Mail notification with every adblock run set this value to 200000.
es: p.ej. para recibir una notificación por E-Mail con cada ejecución de bloque de anuncios, establezca este valor en 200000.
hu: például állítsa ezt az értéket 200000-re minden reklámblokkoló futásánál történő e-mail értesítés fogadásához.
ja: 例: adblock の実行ごとに Eメール通知を受け取るには、値を 200000 に設定します。
pt: por exemplo, para receber uma notificação por e-mail a cada execução adblock, define este valor para 200000.
zh_hans: 例如：要在每次运行 adblock 时收到 E-Mail 通知，请将此值设置为 200000。
