Repository: openwrt/openwrt
Catalog: package/src/luci-app-sms-tool/po/*/sms-tool.po
Languages: ru

source: SMS Messages
ru: SMS-сообщения

source: Received Messages
ru: Полученные сообщения

source: Send Messages
ru: Отправленные сообщения

source: From
ru: От кого

source: Received
ru: Получено

source: Message
ru: Сообщение

source: Configuration
ru: Настройки

source: Sample codes
ru: Примеры кодов

source: Sending USSD codes
ru: Отправка USSD кодов

source: Please enter phone number
ru: Пожалуйста, введите номер телефона

source: Please correct phone number
ru: Проверьте номер телефона

source: Please enter a message text
ru: Пожалуйста, введите текст сообщения

source: Please select the message(s) to be deleted
ru: Пожалуйста, выберите сообщение(я) для удаления

source: Reply
ru: Ответить

source: SMS sent sucessfully
ru: SMS отправлено успешно

source: Please enter a USSD code
ru: Пожалуйста, введите USSD-код

source: Delete selected message(s)?
ru: Удалить выбранные сообщения?

source: Delete all the messages?
ru: Удалить все сообщения?

source: Configuration sms-tool
ru: Настройки sms-tool

source: Configuration panel for sms_tool and gui application.
ru: Панель настроек для sms_tool и графического интерфейса приложения.

source: Device
ru: Устройство

source: Web UI for receiveling messages via sms_tool. More information about the sms-tool on the
ru: Веб-интерфейс для приема сообщений через sms_tool. Подробнее о sms-tool на сайте

source: Web UI for sending messages via sms_tool. More information about the sms-tool on the
ru: Веб-интерфейс для отправки сообщений через sms_tool. Подробнее о sms-tool на сайте

source: Web UI for handling USSD codes via sms_tool. More information about the sms-tool on the
ru: Веб-интерфейс для обработки USSD-кодов через sms_tool. Подробнее о sms-tool на сайте

source: eko.one.pl forum
ru: eko.one.pl форум

source: SIM card
ru: SIM-карта

source: Modem memory
ru: Память модема

source: Messages store in
ru: Хранить сообщения в

source: Messages (Inbox / Maximum)
ru: Сообщения (Входящие / Максимум)

source: Delete Selected
ru: Удалить выбранное

source: Delete message(s)
ru: Удалить сообщение(я)

source: Delete All
ru: Удалить все

source: USSD Codes
ru: Коды USSD

source: Send to
ru: Отправить

source: Message text
ru: Текст сообщения

source: Send Message
ru: Отправить сообщение

source: Code to send
ru: Код для отправки

source: Send Code
ru: Отправить код

source: SMS Settings
ru: Настройки SMS

source: USSD Codes Settings
ru: Настройки USSD-кодов

source: SMS Reading Port
ru: Порт чтения SMS

source: SMS Sending Port
ru: Порт отправки SMS

source: USSD Sending Port
ru: Порт отправки USSD

source: Add Prefix to Phone Number
ru: Добавить префикс к номеру телефона

source: Automatically add prefix to the phone number field.
ru: Автоматически добавлять префикс в поле номера телефона.

source: Prefix Number
ru: Номер префикса

source: PHONE_NUMBER
ru: Номер телефона

source: Refresh SMS
ru: Обновить SMS

source: Sending USSD Code in plain text
ru: Отправка кода USSD в виде обычного текста

source: Receive message without PDU decoding
ru: Получить сообщение без декодирования PDU

source: Send the USSD code in plain text. Command is not being coded to the PDU.
ru: Отправить код USSD в виде обычного текста. Команда не кодируется в PDU.

source: Receive and display the message without decoding it as a PDU.
ru: Получить и отобразить сообщение, не расшифровывая его как PDU.

source: Explanation of number and prefix
ru: Расшифровка номера и префикса

source: In the tab for sending SMSes, show an explanation of the prefix and the correct phone number.
ru: На вкладке для отправки SMS-сообщений покажите объяснение префикса и правильный номер телефона.

source: The phone number should be preceded by the country prefix (for Poland it is 48, without '+'). If the number is 5, 4 or 3 characters, it is treated as 'short' and should not be preceded by a country prefix.
ru: Перед номером телефона должен стоять префикс страны (для Польши это 48 без '+'). Если номер состоит из 5, 4 или 3 символов, он рассматривается как 'короткий' и не должен предшествовать префикс страны.

source: The phone number should be preceded by the country prefix (for Poland it is 48, without +). If the number is 5, 4 or 3 characters, it is treated as.. short and should not be preceded by a country prefix.
ru: Перед номером телефона должен стоять префикс страны (для Польши это 48 без + ). Если номер состоит из 5, 4 или 3 символов, он рассматривается как 'короткий' и поэтому не должен предшествовать префикс страны.

source: Each line must have the following format: 'Contact name;Phone number'. Save to file '/etc/config/phonebook.user'.
ru: Каждая строка должна иметь следующий формат: 'Имя контакта;Номер телефона'. Сохраните в файл '/etc/config/phonebook.user'.

source: User Phonebook
ru: Телефонная книга пользователя

source: User USSD Codes
ru: Пользовательские USSD-коды

source: Each line must have the following format: 'Code name;Code'. Save to file '/etc/config/ussd.user'.
ru: Каждая строка должна иметь следующий формат: 'Название кода;Код'. Сохраните в файл '/etc/config/ussd.user'.

source: Notification Settings
ru: Настройки уведомлений

source: The LED informs about a new message. Before activating this function, please config and save the SMS reading port, time to check SMS inbox and select the notification LED.
ru: Светодиод информирует о новом сообщении. Перед активацией этой функции, пожалуйста, настройте и сохраните порт чтения SMS, время, чтобы проверить входящие SMS и выбрать индикатор уведомления.

source: Check inbox every minute(s)
ru: Проверять входящие каждую(ые) минуту(ы)

source: Specify how many minutes you want your inbox to be checked.
ru: Укажите, сколько минут вы хотите, чтобы ваши входящие проверялись.

source: Notification LED
ru: Индикатор уведомления

source: Select the notification LED.
ru: Выберите индикатор уведомления.

source: Notify new messages
ru: Уведомлять о новых сообщениях

source: Turn on the LED for seconds(s)
ru: Включить светодиод на секунду(ы)

source: Turn off the LED for seconds(s)
ru: Выключить светодиод на секунду(ы)

source: Specify for how long the LED should be on.
ru: Укажите, как долго светодиод должен гореть.

source: Specify for how long the LED should be off.
ru: Укажите, как долго светодиод должен быть выключен.

source: Merge split messages
ru: Объединить разделенные сообщения

source: Checking this option will make it easier to read the messages, but it will cause a discrepancy in the number of messages shown and received.
ru: Выбор этой опции упростит чтение сообщений, но вызовет несоответствие в количестве показанных и полученных сообщений.

source: Message storage area
ru: Область хранения сообщений

source: Messages are stored in a specific location (for example, on the SIM card or modem memory), but other areas may also be available depending on the type of device.
ru: Сообщения хранятся в определенном месте (например, на SIM-карте или в памяти модема), но другие области также могут быть доступны в зависимости от типа устройства».

source: AT Commands
ru: AT-команды

source: Web UI for handling AT commands via sms_tool. More information about the sms-tool on the
ru: Веб-интерфейс для обработки AT-команд через sms_tool. Подробнее о sms-tool на сайте

source: Sending commands to modem
ru: Отправка команд модему

source: User AT Commands
ru: Пользовательские AT-команды

source: Command to send
ru: Команда на отправку

source: Please enter a AT Command
ru: Пожалуйста, введите AT-команду

source: AT Commands Sending Port
ru: Порт отправки AT-команд

source: Send Command
ru: Отправить команду

source: AT Commands Settings
ru: Настройки AT-команд

source: Each line must have the following format: 'AT Command name;AT Command'. Save to file '/etc/config/atcmds.user'.
ru: Каждая строка должна иметь следующий формат: 'Название AT-команды;AT-команда'. Сохраните в файл '/etc/config/atcmds.user'.

source: Restart the inbox checking process every
ru: Перезапускать процесс проверки входящих сообщений каждые

source: The process will restart at the selected time interval. This will eliminate the delay in checking your inbox.
ru: Процесс перезапустится через выбранный интервал времени. Это устранит задержку при проверке ваших сообщений.

source: 4h
ru: 4 часа.

source: 6h
ru: 6 часов.

source: 8h
ru: 8 часов.

source: 12h
ru: 12 часов.

source: The diode is dedicated only to these notifications
ru: Светодиод предназначен только для этих уведомлений

source: Select 'No' in case the router has only one LED or if the LED is multi-tasking.
ru: Выберите« Нет », если на маршрутизаторе есть только один индикатор или если индикатор работает в многозадачном режиме.

source: No
ru: Нет

source: Yes
ru: Да
