Repository: openwrt/openwrt
Catalog: feeds/luci/applications/luci-app-polipo/po/*/polipo.po
Languages: cs, hu, ja, zh_hant

source: Advanced Settings
cs: Pokročilá nastavení
hu: Speciális beállítások
ja: 詳細設定
zh_hant: 進階設定

source: Allowed clients
cs: Povolení klienti
hu: Engedélyezett ügyfelek
ja: アクセスを許可するクライアント
zh_hant: 允許的客戶端

source: Always use system DNS resolver
cs: Vždy používat systémový DNS resolver
hu: Mindig használja a rendszer DNS feloldóját
ja: 常にシステムのDNS名前解決を使用する
zh_hant: 始終使用系統 DNS 解析

source: Basic HTTP authentication supported. Provide username and password in username:password format.
cs: Je podporováno základní ověřování HTTP. Zadejte uživatelské jméno a heslo ve formátu jméno:heslo.
hu: Alap HTTP hitelesítés támogatott. Adjon meg felhasználónevet és jelszót felhasználónév:jelszó formátumban.
ja: Basic認証をサポートしています。"ユーザー名:パスワード"の形式で入力してください。
zh_hant: 支援 HTTP 基本身份驗證。提供使用者名稱和密碼格式為：使用者名稱:密碼。

source: Configuration
cs: Nastavení
hu: Beállítás
ja: 設定
zh_hant: 設定

source: DNS and Query Settings
cs: Nastavení DNS serveru a dotazů
hu: DNS és lekérdezési beállítások
ja: DNSおよびクエリ設定
zh_hant: DNS 及查詢設定

source: DNS server address
cs: Adresa DNS serveru
hu: DNS-kiszolgáló címe
ja: DNSサーバーアドレス
zh_hant: DNS 伺服器位址

source: Delete cache files time
cs: Čas do smazání souborů mezipaměti
hu: Gyorsítótárfájlok törlésének ideje
ja: キャッシュファイルを保持する時間
zh_hant: 清除快取檔案週期

source: Disk cache location
cs: Umístění diskové mezipaměti
hu: Lemezgyorsítótár helye
ja: ディスクキャッシュの保存場所
zh_hant: 磁碟快取位置

source: Do not query IPv6
cs: Nedotazovat na IPv6
hu: Ne kérdezzen le IPv6-ot
ja: IPv6の問い合わせを行わない
zh_hant: 不能查詢 IPv6

source: Enable if cache (proxy) is shared by multiple users.
cs: Povolte, pokud je mezipaměť (proxy) sdílena více uživateli.
hu: Engedélyezze, ha a gyorsítótár (proxy) meg van osztva több felhasználó között.
ja: 複数ユーザーでキャッシュを共有する場合、有効にしてください。
zh_hant: 允許多使用者共享快取（代理）。

source: First PMM segment size (in bytes)
cs: Velikost prvního PMM segmentu (v bajtech)
hu: Az első PMM szegmens mérete (bájtban)
ja: ファーストPMM セグメントサイズ (単位:バイト)
zh_hant: 第一 PMM 段大小（以位元組表示）

source: General Settings
cs: Obecné nastavení
hu: Általános beállítások
ja: 一般設定
zh_hant: 通用設定

source: How much RAM should Polipo use for its cache.
cs: Velikost paměti RAM, kterou může Polipo použít jako mezipamět.
hu: Mennyi RAM-ot használjon a Polipo a gyorsítótárához.
ja: PolipoがRAM上で使用するキャッシュサイズを設定してください。
zh_hant: 允許 Polipo 做快取的 RAM 使用量

source: In RAM cache size (in bytes)
cs: Velikost RAM mezipaměti (v bajtech)
hu: RAM-ban lévő gyorsítótár mérete (bájtban)
ja: RAM キャッシュサイズ (単位:バイト)
zh_hant: RAM 快取大小（以位元組表示）

source: Listen address
cs: Naslouchající adresa
hu: Cím figyelése
ja: 待ち受けアドレス
zh_hant: 監聽位址

source: Listen port
cs: Naslouchající port
hu: Port figyelése
ja: 待ち受けポート
zh_hant: 監聽埠

source: Location where polipo will cache files permanently. Use of external storage devices is recommended, because the cache can grow considerably. Leave it empty to disable on-disk cache.
cs: Umístění, kde bude Polipo trvale ukládat soubory do mezipaměti. Doporučuje se použití externích paměťových zařízení, protože mezipaměť může výrazně růst. Chcete-li deaktivovat diskovou mezipaměť, ponechte prázdné.
hu: Az a hely, ahová a Polipo tartósan gyorsítótárazza a fájlokat. Külső tárolóeszköz használata ajánlott, mert a gyorsítótár jelentősen megnőhet. Hagyja üresen a lemezen lévő gyorsítótár letiltásához.
ja: Polipoが使用するキャッシュファイルの保存場所を設定します。キャッシュは頻繁に更新されるため、外部デバイスに保存することを推奨します。空欄に設定した場合、ディスクキャッシュは無効化されます。
zh_hant: Polipo 持久快取檔案位置。建議使用外部儲存裝置，因為快取會一直增長。留空表示禁用磁碟快取。

source: Log file location
cs: Umístění souboru protokolu
hu: Naplófájl helye
ja: ログファイルの保存場所
zh_hant: 日誌存放位置

source: Log to syslog
cs: Protokolovat do syslog
hu: Naplózás a rendszernaplóba
ja: syslogにログを記録する
zh_hant: 記錄日誌到 syslog

source: Logging and RAM
cs: Protokolování a paměť RAM
hu: Naplózás és RAM
ja: ログとRAM設定
zh_hant: 記錄和 RAM

source: Never use system DNS resolver
cs: Nikdy nepoužívat systémový DNS resolver
hu: Sose használja a rendszer DNS feloldóját
ja: システムのDNS名前解決を使用しない
zh_hant: 從不使用系統 DNS 解析

source: On-Disk Cache
cs: Mezipaměť na disku
hu: Lemezen lévő gyorsítótár
ja: ディスクキャッシュ
zh_hant: 磁碟快取

source: PMM segments size (in bytes)
cs: Velikost PMM segmentů (v bajtech)
hu: PMM szegmens mérete (bájtban)
ja: PMM セグメントサイズ (単位:バイト)
zh_hant: PMM 段大小（以位元組表示）

source: Parent Proxy
cs: Nadřazený proxy server
hu: Szülőproxy
ja: 親プロキシ
zh_hant: 上層代理

source: Parent proxy address
cs: Adresa nadřazeného proxy serveru
hu: Szülőproxy címe
ja: 親プロキシ・アドレス
zh_hant: 上層代理位址

source: Parent proxy address (in host:port format), to which Polipo will forward the requests.
cs: Adresa nadřazeného proxy serveru (ve formátu hostitel:port), kterému bude Polipo přeposílat požadavky.
hu: Szülőproxy címe (gép:port formátumban), amelyhez a Polipo továbbítani fogja a kéréseket.
ja: Polipoがリクエストを転送する、親プロキシサーバーのアドレスを"ホスト:ポート番号"の形式で設定してください。
zh_hant: Polipo 應該轉發請求所到的上層代理（以 主機:埠號 格式表示）。

source: Parent proxy authentication
cs: Autentizace pro nadřazený proxy server
hu: Szülőproxy hitelesítése
ja: 親プロキシの認証
zh_hant: 上層代理位址驗證

source: Polipo Status
cs: Stav Polipo
hu: Polipo állapot
ja: Polipo ステータス
zh_hant: Polipo 狀態

source: Polipo is a small and fast caching web proxy.
cs: Polipo je malý a rychlý kešující web proxy server.
hu: A Polipo egy kicsi és gyors gyorsítótárazó webes proxy.
ja: Polipoは、軽量で高速なWEBプロキシキャッシュサーバーです。
zh_hant: Polipo 是一個小型且快速的網頁快取代理。

source: Poor Man's Multiplexing
cs: <abbr title="Poor Mans Multiplexing; Multiplexování pro chudé">PMM</abbr>
hu: Szegény ember multiplexelése
zh_hant: 窮人的多工複用器

source: Poor Man's Multiplexing (PMM) is a technique that simulates multiplexing by requesting an instance in multiple segments. It tries to lower the latency caused by the weakness of HTTP protocol. NOTE: some sites may not work with PMM enabled.
cs: Poor Man's Multiplexing (PMM, Multiplexování pro chudé) je technika, která simuluje multiplexování tím, že žádá o jednu instanci ve více segmentech. Snaží se snížit latence způsobené nedokonalosti HTTP protokolu. POZNÁMKA: nekteré stránky nemusí fungovat s povoleným PMM.
hu: A szegény ember multiplexelése (PMM – Poor Man’s Multiplexing) egy olyan technika, amely egy példány kérelmezésével szimulálja a multiplexelést több szegmensben. Megpróbálja lecsökkenteni a HTTP protokoll gyengesége által okozott késleltetést. MEGJEGYZÉS: néhány oldal esetleg nem működik, ha a PMM engedélyezve van.
ja: Poor Man's Multiplexing (PMM) は、複数のセグメントに渡ってインスタンスをリクエストすることで、多重化をシュミレートする技術であり、HTTPプロトコルの弱点によるレイテンシを低減する試みを行います。注意:PMMを有効にしていると、いくつかのサイトではつながらなくなる可能性があります。
zh_hant: 窮人的多工複用器（PMM）是通過在多個區段中請求單個例項來模擬複用的技術。它嘗試降低由 HTTP 協議的弱點引起的延遲。注意：某些站點可能無法啟用 PMM。

source: Port on which Polipo will listen
cs: Port, na kterém Polipo naslouchá
hu: A port, amelyen a Polipo figyelni fog
ja: Polipoが待ち受けを行うポート番号です。
zh_hant: Polipo 監聽的埠號

source: Proxy
ja: プロキシ
zh_hant: 代理伺服器

source: Query DNS by hostname
cs: DNS požadavky
hu: DNS lekérdezése gépnév szerint
ja: ホスト名のDNS問い合わせ
zh_hant: 以主機名稱查詢 DNS

source: Query DNS directly, fallback to system resolver
cs: Dotazovat se DNS napřímo, posléze ustoupit k systémovému resolveru
hu: DNS közvetlen lekérdezése, tartalék a rendszer feloldója
zh_hant: 直接查詢 DNS，失敗時退回系統解析

source: Query DNS directly, for unknown hosts fall back to system resolver
cs: Dotazovat se přímo DNS, posléze pro neznámé hostitele ustoupit k systémovému resolveru
hu: DNS közvetlen lekérdezése, ismeretlen gépeknél visszatérés a rendszer feloldójára
zh_hant: 直接查詢 DNS，對未知的主機退回系統解析

source: Query DNS for IPv6
cs: Dotazovat se DNS na IPv6
hu: DNS lekérdezése IPv6-hoz
ja: IPv6 DNS問い合わせ
zh_hant: 為 IPv6 查詢 DNS

source: Query IPv4 and IPv6, prefer IPv4
cs: Dotazovat se na IPv4 a IPv6, preferovat IPv4
hu: IPv4 és IPv6 lekérése, IPv4 előnyben részesítése
ja: IPv4とIPv6の問い合わせを行う (IPv4を優先)
zh_hant: 查詢 IPv4 和 IPv6，IPv4 優先

source: Query IPv4 and IPv6, prefer IPv6
cs: Dotazovat se na IPv4 a IPv6, preferovat IPv6
hu: IPv4 és IPv6 lekérése, IPv6 előnyben részesítése
ja: IPv4とIPv6の問い合わせを行う (IPv6を優先)
zh_hant: 查詢 IPv4 和 IPv6，IPv6 優先

source: Query only IPv6
cs: Dotazovat se pouze na IPv6
hu: Csak IPv6 lekérdezése
ja: IPv6のみ問い合わせを行う
zh_hant: 只查詢 IPv6

source: Set the DNS server address to use, if you want Polipo to use different DNS server than the host system.
cs: Nastavte DNS server, pokud chcete, aby Polipo používalo jiný, než systémový DNS server.
hu: Állítsa be a használandó DNS-kiszolgáló címét, ha azt szeretné, hogy a Polipo eltérő DNS-kiszolgálót használjon mint a gazdarendszer.
ja: Polipoがシステムとは別のDNSサーバーを使用する場合、DNSサーバーのアドレスを設定してください。
zh_hant: 設定 DNS 伺服器位址以便使用，假如您要讓 Polipo 使用不同的 DNS 伺服器，而非主機系統的。

source: Shared cache
cs: Sdílená mezipaměť
hu: Megosztott gyorsítótár
ja: 共有キャッシュ
zh_hant: 共享的快取

source: Size of the first PMM segment. If not defined, it defaults to twice the PMM segment size.
cs: Velikost prvního PMM segmentu. Pokud není definováno, výchozí hodnota je dvojnásobná velikost PMM segmentu.
hu: Az első PMM szegmens mérete. Ha nincs meghatározva, akkor alapértelmezetten a PMM szegmens méretének kétszerese.
ja: 最初のPMM セグメントのサイズを設定します。設定されなかった場合、PMM セグメントサイズの倍のサイズをデフォルト値として設定します。
zh_hant: 第一個 PMM 段的大小，若未定義，預設為兩倍 PMM 段的大小。

source: Size to which cached files should be truncated
cs: Velikost, na kterou budou zkráceny soubory mezipaměti
hu: A méret, amelyre a gyorsítótárazott fájlokat csonkolni kell
zh_hant: 快取檔案應截斷為的大小

source: Status
cs: Stav
hu: Állapot
ja: ステータス
zh_hant: 狀態

source: Syslog facility
cs: Zařízení syslog
hu: Rendszernapló összetevő
ja: Syslog ファシリティ
zh_hant: 日誌設施

source: The interface on which Polipo will listen. To listen on all interfaces use 0.0.0.0 or :: (IPv6).
cs: Rozhraní, na kterém bude Polipo naslouchat. Chcete-li naslouchat na všech rozhraních, použijte 0.0.0.0 nebo :: (IPv6).
hu: A csatoló, amelyen a Polipo figyelni fog. Az összes csatolón történő figyeléshez használjon 0.0.0.0 vagy :: (IPv6) címeket.
ja: Polipoが待ち受けを行うインターフェースです。0.0.0.0 または :: (IPv6) を設定した場合、全てのインターフェースで待ち受けを行います。
zh_hant: Polipo 將會監聽的介面。要監聽所有介面，請使用 0.0.0.0 或 ::（IPv6）。

source: Time after which cached files will be deleted
cs: Čas, po kterém budou odstraněny soubory v mezipaměti
hu: Az idő, amely után a gyorsítótárazott fájlok törölve lesznek
zh_hant: 快取刪除前的留存時間

source: Time after which cached files will be truncated
cs: Čas, po kterém budou soubory v mezipaměti zkráceny
hu: Az idő, amely után a gyorsítótárazott fájlok csonkolva lesznek
zh_hant: 快取截斷前的留存時間

source: To enable PMM, PMM segment size must be set to some positive value.
cs: Chcete-li povolit PMM, musí být velikost segmentu PMM nastavena na určitou kladnou hodnotu.
hu: A PMM engedélyezéséhez a PMM szegmens méretét valamilyen pozitív értékre kell beállítani.
ja: PMM を有効にする場合、PMM セグメントサイズには正の値を設定してください。
zh_hant: 要啟用 PMM，PMM 段大小必須為正。

source: Truncate cache files size (in bytes)
cs: Zkrátit velikost souborů mezipaměti (v bajtech)
hu: Gyorsítótárfájl méretének csonkolása (bájtban)
zh_hant: 快取檔案截斷大小（以位元組為單位）

source: Truncate cache files time
cs: Čas pro zkrácení velikosti souborů mezipaměti
hu: Gyorsítótárfájlok csonkolásának ideje
zh_hant: 快取檔案截斷時間

source: Use of external storage device is recommended, because the log file is written frequently and can grow considerably.
cs: Doporučuje se používat externí paměťové zařízení, protože do soubor protokolu je často zapisováno a může značně narůstat.
hu: Külső tárolóeszköz használata ajánlott, mert a naplófájl gyakran kerül kiírásra és jelentősen megnőhet.
ja: ログファイルは頻繁に更新されるため、外部デバイスに保存することを推奨します。
zh_hant: 推薦使用外部儲存裝置，因為日誌檔案經常寫入，將會迅速增長。

source: When listen address is set to 0.0.0.0 or :: (IPv6), you must list clients that are allowed to connect. The format is IP address or network address (192.168.1.123, 192.168.1.0/24, 2001:660:116::/48 (IPv6))
cs: Pokud je adresa pro naslouchání nastavena na 0.0.0.0 nebo:: (IPv6), je třeba uvést klienty, kterým je povoleno připojení. Formát je adresa IP nebo síťová adresa (192.168.1.123, 192.168.1.0/24, 2001:660:116::/48 (IPv6))
hu: Ha a figyelési cím 0.0.0.0 vagy :: (IPv6) értékre van beállítva, akkor fel kell sorolnia azokat az ügyfeleket, amelyeknek engedélyezett a kapcsolódás. A formátum IP-cím vagy hálózati cím (192.168.1.123, 192.168.1.0/24, 2001:660:116::/48 (IPv6))
ja: 待ち受けアドレスを0.0.0.0 または :: (IPv6) に設定した場合、アクセスを許可するクライアントアドレスを設定してください。設定フォーマットはIPアドレスかネットワークアドレスです。(例:192.168.1.123, 192.168.1.0/24, 2001:660:116::/48 (IPv6))
zh_hant: 當監聽位址設定為 0.0.0.0 或 ::（IPv6）時，必須列出允許連線的客戶端。格式為 IP 位址或網路位址（192.168.1.123，192.168.1.0/24，2001:660:116::/48（IPv6））

source: enable
cs: povolit
hu: engedélyezés
ja: サービスを有効にする
zh_hant: 啟用
