Repository: openwrt/openwrt
Catalog: feeds/luci/applications/luci-app-vnstat/po/*/vnstat.po
Languages: el, es, ro, ru

source: Configuration
el: Διαμόρφωση
es: Configuración
ro: Configurație
ru: Конфигурация

source: Daily traffic
el: Ημερήσια κίνηση
es: Tráfico diario
ro: Trafic zilnic
ru: Трафик за день

source: Graphs
el: Γραφικές παραστάσεις
es: Gráficos
ro: Grafice
ru: Графики

source: Hourly traffic
el: Ωριαία κίνηση
es: Tráfico por horas
ro: Trafic la fiecare ora
ru: Трафик за час

source: Monitor selected interfaces
el: Παρακολούθηση επιλεγμένων διεπαφών
es: Monitorear las interfaces seleccionadas
ro: Monitorizeaza interfetele selectate
ru: Собирать статистику на выбранных интерфейсах

source: Monthly traffic
el: Μηνιαία κίνηση
es: Tráfico mensual
ro: Trafic lunar
ru: Трафик за месяц

source: No database has been set up yet. Go to the VnStat configuration and enable monitoring for one or more interfaces.
el: Δεν έχει δημιουργηθεί ακόμα βάση δεδομένων. Μεταβείτε στη διαμόρφωση του VnStat και ενεργοποιήστε την παρακολούθηση για μία ή περισσότερες διεπαφές.
es: Todavía no se ha configurado ninguna base de datos. Vaya a la configuración de VnStat y active la monitorización para una o más interfaces.
ro: Nu a fost setata nici o baza de date. La configurarea VnStat se poate activa monitoriza pentru una sau mai multe interfete.
ru: База данных не настроена. Выполните настройки и укажите интерфейсы для сбора статистики.

source: Restart VnStat
el: Επανεκκίνηση VnStat
es: Reiniciar VnStat
ro: Restarteaza VnStat
ru: Перезапустить VnStat

source: Summary display
el: Συνοπτική προβολή
es: Mostrar resumen
ro: Afiseaza sumarul
ru: Сводная статистика

source: Top 10 display
el: Εμφάνιση 10 κορυφαίων
es: Mostrar Top 10
ro: Afiseaza top 10
ru: Последние 10

source: Update »
el: Ενημέρωση »
es: Actualizar »
ro: Updateaza »
ru: Обновить »

source: VnStat Graphs
el: Γραφική παράσταση VnStat
es: Graficas de VnStat
ro: Graficele VnStat
ru: Графики VnStat

source: VnStat Traffic Monitor
el: Παρακολούθηση κίνησης VnStat
es: Monitor de trafico de VnStat
ro: Monitorul de trafic VnStat
ru: Монитор трафика VnStat

source: VnStat is a network traffic monitor for Linux that keeps a log of network traffic for the selected interface(s).
el: Το VnStat είναι ένα σύστημα παρακολούθησης της κίνησης δικτύου για το Linux το οποίο διατηρεί ένα αρχείο καταγραφής της κίνησης δικτύου για την/τις επιλεγμένη/ες διεπαφή/ές.
es: VnStat es un monitor de tráfico de red para Linux que mantiene un registro del trafico de red de la interfaz o interfaces seleccionadas.
ro: Vnstat este un monitor de retea ce pastreaza detalii legate de traficul pe interfetele selectate.
ru: VnStat - монитор сетевого трафика для Linux, собирающий статистику по выбранным интерфейсам.
