Repository: openwrt/openwrt
Catalog: feeds/luci/applications/luci-app-noddos/po/*/noddos.po
Languages: es, pl, pt, ru, zh_hant

source: Class
es: Clase
pl: Klasa
pt: Classe
ru: Класс
zh_hant: 類

source: Client Firewall
es: Firewall del cliente
pl: Zapora sieciowa klienta
pt: Firewall do Cliente
ru: Клиент межсетевого экрана
zh_hant: 客戶端防火牆

source: Clients
es: Clientes
pl: Klienci
pt: Clientes
ru: Клиенты
zh_hant: 客戶端

source: DhcpHostname
es: Nombre de host de Dhcp
pl: Nazwa hosta DHCP
ru: DHCP имя хоста

source: DhcpVendor
es: Proveedor de Dhcp

source: Don't monitor these IPv4 addresses
es: No monitoree estas direcciones IPv4
pl: Nie monitoruj tych adresów IPv4
pt: Não monitorar estes endereços IPv4
ru: Не отслеживать эти IPv4-адреса.
zh_hant: 不要監視這些 IPv4 位址

source: Don't monitor these IPv6 addresses
es: No monitoree estas direcciones IPv6
pl: Nie monitoruj tych adresów IPv6
pt: Não monitorar estes endereços IPv6
ru: Не отслеживать эти IPv6-адреса.
zh_hant: 不要監視這些 IPv6 位址

source: Don't monitor these MAC addresses
es: No monitoree estas direcciones MAC
pl: Nie monitoruj tych adresów MAC
pt: Não monitorar estes endereços MAC
ru: Не отслеживать эти MAC-адреса.
zh_hant: 不要監視這些 MAC 位址

source: Excluded IPv4 addresses
es: Direcciones IPv4 excluidas
pl: Wykluczone adresy IPv4
pt: Endereços IPv4 excluídos
ru: Исключить IPv4-адреса
zh_hant: 排除的 IPv4 位址

source: Excluded IPv6 addresses
es: Direcciones IPv6 excluidas
pl: Wykluczone adresy IPv6
pt: Endereços IPv6 excluídos
ru: Исключить IPv6-адреса
zh_hant: 排除的 IPv6 位址

source: Excluded MAC addresses
es: Direcciones MAC excluidas
pl: Wykluczone adresy MAC
pt: Endereços MAC excluídos
ru: Исключить MAC-адреса
zh_hant: 排除的 MAC 位址

source: Hostname
es: Nombre del host
pl: Nazwa hosta
pt: Nome do Host
ru: Имя хоста
zh_hant: 主機名

source: Manufacturer
es: Fabricante
pl: Producent
pt: Fabricante
ru: Производитель
zh_hant: 製造商

source: Model
es: Modelo
pt: Modelo
ru: Модель
zh_hant: 模型

source: Noddos Client Tracking
es: Seguimiento de clientes Noddos
pl: Śledzenie klienta Noddos
pt: Rastreamento de Clientes Noddos
ru: Noddos сопровождение клиентов сети
zh_hant: Noddos 客戶端跟蹤

source: Noddos Clients
es: Clientes Noddos
pl: Klienci Noddos
pt: Clientes Noddos
ru: Клиенты Noddos
zh_hant: Noddos 客戶端

source: Noddos controls traffic from the clients on your network to the Internet. This helps protect your network, the bandwidth on your Internet connection and the Internet
es: Noddos controla el tráfico de los clientes en su red a Internet. Esto ayuda a proteger su red, el ancho de banda en su conexión a Internet e Internet
pl: Noddos steruje ruchem sieci od klientów do Internetu. Pomaga to chronić sieć, przepustowość połączenia internetowego i Internetu
pt: O Noddos controla o tráfego dos clientes da sua rede à Internet. Isto ajuda a proteger a sua rede, a largura de banda na sua conexão à Internet e a Internet
ru: Noddos контролирует трафик клиентов в сети Интернет.<br />Это помогает защитить сеть, улучшить качество подключения к Интернету и пропускную способность Интернета.
zh_hant: Noddos 控制您網路上的客戶端到網際網路的流量。這有助於保護您的網路、您的網際網路連接以及網際網路

source: Private networks
es: Redes privadas
pl: Sieci prywatne
pt: Redes privadas
ru: Частные сети
zh_hant: 私人網路

source: Recognized Clients
es: Clientes reconocidos
pl: Znani klienci
pt: Clientes Reconhecidos
ru: Признанные клиенты
zh_hant: 認可的客戶

source: Report traffic to private networks (10/8, 172.16/12, 192.168/16, fd75:6b5d:352c:ed05::/64)
es: Informe de tráfico a redes privadas (10/8, 172.16/12, 192.168/16, fd75:6b5d:352c:ed05::/64)
pl: Raportowanie ruchu do sieci prywatnych (10/8, 172.16/12, 192.168/16, fd75:6b5d:352c:ed05::/64)
pt: Reportar trafego para redes privadas (10/8, 172.16/12, 192.168/16, fd75:6b5d:352c:ed05::/64)
ru: Отчет о трафике в частных сетях (10/8, 172.16/12, 192.168/16, fd75:6b5d:352c:ed05::/64).
zh_hant: 報告專用網路流量（10/8，172.16/12，192.168/16，fd75:6b5d:352c:ed05::/64）

source: Server Settings
es: Configuración del servidor
pl: Ustawienia serwera
pt: Configurações do Servidor
ru: Настройки сервера
zh_hant: 伺服器設定

source: The following clients have been discovered on the network. The last discovery was completed at
es: Los siguientes clientes han sido descubiertos en la red. El último descubrimiento se completó en
pl: W sieci wykryto następujących klientów. Ostatnie odkrycie zostało zakończone na
pt: Os seguintes clientes foram descobertos na rede. A última descoberta foi concluída em
ru: В сети были обнаружены следующие клиенты. Последний найденный клиент был обнаружен
zh_hant: 已在網路上發現以下客戶端。最後發現於

source: Unrecognized Clients
es: Clientes no reconocidos
pl: Nierozpoznani klienci
pt: Clientes não Reconhecidos
ru: Не распознанные клиенты
zh_hant: 無法識別的客戶端

source: Upload anonimized traffic stats
es: Subir estadísticas de tráfico anonimizadas
pl: Prześlij anonimowe statystyki ruchu
pt: Enviar estatísticas de tráfego anonimizadas
ru: Статистика трафика
zh_hant: 上傳匿名流量統計資訊

source: Uploading your statistics helps improving device recognition and discovering hacked devices & botnets
es: Cargar sus estadísticas ayuda a mejorar el reconocimiento de dispositivos y descubrir dispositivos botnets pirateados
pl: Przesyłanie statystyk pomaga poprawić rozpoznawanie urządzeń i odkrywanie zhakowanych urządzeń i botnetów
pt: O envio das suas estatísticas ajuda a melhorar o reconhecimento de aparelhos e a descobrir aparelhos e redes de bots hackeados
ru: Загрузка статистики помогает улучшить распознавание устройств и обнаружение взломанных устройств и ботнетов.
zh_hant: 上傳統計資訊有助於提高裝置識別率，並發現被駭客入侵的裝置及殭屍網路
